[
    "Dishes are properly prepared with great care, good Italian food",
    "Excellent food - cured tuna special salad, Mezze Maniche, Tortelloni, and Crema Cotta for dessert",
    "Good food",
    "Main course was great, sides were just ok, coffee was great",
    "Food quality is excellent with well-prepared and nicely presented dishes. Standout bacalao appetizer with cloud-like cod on polenta cubes. Wide selection of appetizers, pasta, and entrees catering to meat, fish, and vegetarian preferences. Pasta portions are small.",
    "Great Italian food",
    "PreFix was a great choice",
    "Good flavors, well presented Italian food",
    "Good food",
    "Loved the tortellini parmigiana",
    "Every morsel of food was phenomenal, Branzino was perfect, pastas were exceptional",
    "The Vitello Tonnato was excellent, tagliatelle pasta with duck ragu was light and delightful, lamb was cooked to a perfect rosy pink with well-prepared artichokes, excellent desserts available.",
    "",
    "Food was delightful",
    "Cocktails were loved, linguini with clams was very good, bolognese beef pasta was a hit",
    "Menu has variety, food was great, fresh and well-portioned",
    "Meal was exceptional with good value for the area",
    "Two dishes were great, one dish was unsatisfactory and left untouched",
    "Good Italian menu with excellent duck mousse, arancini, pasta dishes and pulpo",
    "Great homemade pasta",
    "Food was very good",
    "Branzino and cappaletti were great; linguine with clams and pasta Nero were flavorless, pasta Nero missing calamari; desserts not great with refrigerated taste",
    "Delicious food",
    "Arancini was perfect, tagliatelle pasta with duck was well-prepared and complemented the dish, bolognese was enjoyable, cocktails were beautiful and tasty",
    "Food was great but portion size was too small for the price",
    "",
    "Food was excellent",
    "Food is excellent",
    "Bread was good, cappelletti was too sweet with excessive raisins, risotto was good, pork and bistecci were enjoyable, pappardelle verde, mezze maniche and linguini with clams were served, oevo salad was large and lightly dressed. Desserts included sorbet, dark chocolate mousse and crema cotta.",
    "Many delicious and well prepared options to choose from",
    "Excellent food",
    "Food: Very good",
    "Delicious food",
    "Food is enjoyable",
    "Basic and badly executed pasta dishes",
    "Food quality declined from amazing in previous visits to very average in recent visit",
    "Excellent food",
    "Paparadelle with truffles was outstanding with delicious flavors and perfect bite on the house-made pasta, plentiful and delicious iced tea",
    "Food was bland, lacking seasoning/salt",
    "Great food with beautiful presentations",
    "Dish was floating in oil and fairly tasteless",
    "Delicious food",
    "Excellent Italian cuisine, great bar",
    "All dishes (starter, pasta, and fish entree) were excellent",
    "Starters were great, main course good, wine top notch",
    "Terrific and creative tasting menu",
    "Delicious food, creative entrées and appetisers, fresh and local ingredients",
    "No food review provided",
    "Great food",
    "No specific food quality feedback provided",
    "The review does not contain specific information about food quality or service quality.",
    "Mezze Maniche Bolognese was prepared to perfection and delicious",
    "Delicious appetizers, amazing entrees, scrumptious dessert",
    "Food was great",
    "Superb food",
    "The Capeletti was to die for",
    "Food is exceptional",
    "Food amazing",
    "Great food",
    "No specific food review provided",
    "Not the typical fried food",
    "Every course was amazing including homemade pasta with shrimp, fried cod with artichokes, and chocolate fudge with gelato",
    "Delicious food, truly exceptional Italian cuisine",
    "Food is mediocre and overpriced",
    "Tortelloni with eggplant was outstanding",
    "delicious food",
    "Food was good, especially the Gambari",
    "Food quality not specifically mentioned in the review",
    "Bread available but at additional cost",
    "Manhattan's are excellent, hors d'oeuvres were good, pork chop plate was delicious",
    "The menu has unique variations and excellent pasta dishes",
    "Wonderful pappardelle with amazing mushrooms, excellent pomodoro salad, good Italian white wine",
    "Food was exceptional",
    "Wonderful and creative pasta dishes",
    "The pate, shrimp, fettuccine, chicken breast, and mousse dessert were exceptional. The salumi platter was well-prepared with house-made items including crackers.",
    "Every dish is unique and wonderful, always surprising, complex exceeds high expectations.",
    "Amazing food experience with 4 Sardinian dishes, delicious and unique dishes",
    "Yummy salads, biscotti for desert",
    "Food review: Cocktails were just okay and pricey. Appetizers included pate (favorite) and cheese flan (mild, almost bland). Pasta portions were small but enjoyable, with Capelleti being the standout dish. Steak was underwhelming and flavorless. Desserts (strawberry en croute and cheesecake) were bland. Cappuccinos were good.",
    "Mixed green salad was good, bread basket had variety, papparadelle pasta was undercooked and under-seasoned",
    "Excellent meal with a quartet of sorbets for dessert",
    "Cacio e pepe was served cool and glutinous sticky; prawns were very good",
    "The Cacio e Pepe was outstanding",
    "Fantastic food but small portions",
    "Excellent dinner menu, cocktail and wine selections",
    "Food was excellent",
    "Very satisfying salad, charcuterie, and pasta, perfect food, manageable portion sizes, great dessert",
    "",
    "Food was fantastic, chocolate dessert was notable, orange rosemary crema cotta had impressive and unique flavor combinations",
    "Food was inconsistent - some courses were excellent while others fell short of expectations, indicating experimental dishes with mixed results",
    "Excellent food and well mixed drinks",
    "Authentic Italian food expertly prepared",
    "Arancini needed more sauce for better flavor, good food overall",
    "Food was delicious with small portions but well prepared",
    "Original Italian recipes made with high quality ingredients",
    "Delicious food",
    "This review does not contain specific information about food quality or service quality to extract.",
    "Good food",
    "Beautifully executed unusual dishes",
    "Fish stew perfect, uovo salad amazing",
    "Great salads and octopus with squid.",
    "Food and recommended wines were amazing",
    "Pasta dishes were cold and stiff, steak was underwhelming",
    "Cocktails, bread, main dishes (fish and lamb) and dessert were well-prepared, richly flavored and delicious",
    "Food is outstanding",
    "Food was superb",
    "Simple flavors well executed, generous portions with artistry in presentation. Lamb main course with fregola and asparagus was particularly tasty. Special Easter dessert was good.",
    "The food was excellent, pasta was served al dente",
    "Great menu",
    "No food review provided",
    "The food was delicious",
    "Great menu",
    "Great food",
    "Fantastic meal",
    "Food is usually delicious",
    "Great food",
    "Food was on point and delicious",
    "THE FOOD is THE BEST!",
    "Food was excellent, with a fantastic black truffle appetizer over a flan like cheese and toasted Parmesan. Pastas were fresh and delicious.",
    "Good food",
    "Food is of highest quality; ravioli stuffed with puréed prosciutto, dusted with cheese, topped with fig reduction drizzle was tasty; Uovo salad is enjoyable",
    "",
    "All dishes were excellent",
    "No specific food quality feedback provided",
    "Incredible food, chicken and branzino were wow, wine was divine",
    "Delicious food, interesting menu items and excellent desserts",
    "Fresh classic menu but flavors and sauces not well blended, octopus tentacle was tough, aranchini appetizer had overwhelming aged Parmesan taste",
    "",
    "No food quality information provided",
    "Each course of the prix fix menu was delightful",
    "Roasted veggie side dish was perfect but the mushroom pasta dish was lackluster. The mushrooms were rubbery like they had been boiled vs roasted and dish was significantly underseasoned.",
    "Delicious food, beautifully presented; linguine with mushrooms and guanciale had unique flavor",
    "Food was delicious",
    "Food is always excellent",
    "Delicious three course meal",
    "Delicious food, creative choices",
    "Amazing special-occasion dining with subtle flavors and delicious fresh ingredients, featuring traditional and experimental Mediterranean dishes",
    "Delicious bacala and octopus, chicken dishes",
    "Food was excellent",
    "Excellent food",
    "",
    "Food was good overall with pasta dishes being very good, but duck breast was marginal and served barely warm",
    "Tasty food with high quality ingredients, parmigiana with black truffle was a standout dish",
    "",
    "Food was excellent - appetizers were perfect, entrees were divine, and desserts were sublime.",
    "High quality and innovative Italian cuisine with unique pasta dishes",
    "Food and drinks were amazing",
    "Authentic & originally crafted dishes; superb cocktails",
    "Dependable upscale Italian food, pulpo (octopus) was enjoyable",
    "Excellent food from appetizer to dessert",
    "Great food",
    "Food is superior",
    "Great menu",
    "Good food",
    "Authentic Italian food",
    "Started with a refreshing salad of beets, oranges, whipped ricotta and pistachios. The cappelletti pasta dish with ricotta, prosciutto and walnuts was exquisite. The duck special was excellent",
    "Great food, inventive cocktails",
    "Excellent pappardelle",
    "No specific food quality information provided",
    "Dishes were wonderfully prepared, Pappardelle was great",
    "Food was great",
    "Food was overpriced",
    "Food was amazing",
    "Food excellent",
    "Cuisine was good",
    "Great Italian food and cocktails, daily specials are always interesting",
    "Uovo salad, pasta with sugo, and pork chop with polenta and mushrooms were delicious",
    "Food was excellent",
    "Food was generally good",
    "Food was excellent",
    "Appetizers and calamari and octopus were amazing",
    "Food was delicious",
    "Great food",
    "Radicchio salad, seafood stew, risotto, cace de pepe, sorbets and Italian cookies were all delicious",
    "Food and wine were outstanding",
    "Beef tartar with bone marrow was underwhelming, arancini average, branzino was good, risotto was watery and lacked flavor, affogato was basic ice cream with coffee on top",
    "Excellent menu",
    "Tagliatelle pasta with fresh shaved truffle was phenomenal, life-changing",
    "Excellent food",
    "Fantastic authentic Italian food with wonderful house made pasta",
    "Excellent food",
    "High quality Italian food",
    "No food review provided",
    "Food superb",
    "",
    "Food was delicious and consistent",
    "Home-made pastas are excellent, particularly the ravioli; cioppino was perfect",
    "Great food - truffle special was very good",
    "Homemade pastas cooked perfectly, big portions on all non-pasta dishes",
    "No food review provided",
    "delicious meal",
    "Food has been great with enough variety and new dishes to try",
    "Fantastic food",
    "Great food with good vegan and vegetarian options",
    "Amazing cocktails, very good pizzetta starter, perfectly cooked steak",
    "Excellent food",
    "Menu was prix fix",
    "No specific food quality feedback provided",
    "Food and drinks were outstanding",
    "delicious food",
    "Food was excellent, pasta dishes paired well with red wine",
    "Always delicious and interesting dishes",
    "Food tastes good but small portion",
    "Food was flat and lacking flavor; octopus special had few small pieces in bland grayish puree; tomato sauce appetizer was minimal with three croutons, tiny cheese piece and single basil leaf; risotto was sweet like rice pudding despite correct cooking",
    "Delicious food and wine",
    "Great Italian cuisine, wonderful drinks and dessert",
    "Decent food but overpriced",
    "Best Italian food in the East Bay, Chef Gianluca Guglielmi understands sapore with deep feel for savor",
    "Delicious food",
    "Aperol spritzes delicious, pate with quince jam excellent, pasta slightly undercooked and chewy, sauce good with plenty of mussels and clams",
    "Food was pleasant",
    "Food review: Authentic Italian food, excellent pasta dishes, small Salumi starter, good desserts, breadsticks could be improved with bread instead.",
    "",
    "Great food",
    "",
    "Authentic excellent Italian food",
    "Great food",
    "Authentic Italian food, huge portion of perfectly ripe melon with layers of prosciutto",
    "Food was great",
    "Great menu and cocktails",
    "Each selection full of flavors and perfectly prepared",
    "Food was beautifully presented with diverse appetizer options, all dishes were enjoyable",
    "Great restaurant",
    "Creative Italian menu, wonderfully executed",
    "Food service was extremely delayed, taking 1.5-2 hours for the food to arrive, while other customers who ordered later received their meals first.",
    "No clear food or service review details provided in this feedback.",
    "Food was excellent with superior taste and creativity, menu offered excellent choices",
    "Pasta dish was extremely salty, lacked advertised Calabrian chili, contained fresh tomatoes instead of sun-dried tomatoes as mentioned in menu",
    "Food was outstanding",
    "Excellent grilled gambas, well-prepared Branzino, and good meat sauce pasta",
    "delicious food",
    "No specific food review provided",
    "excellent ingredient focused Italian food",
    "Food was excellent with great wine selections",
    "Shrimp and pesto linguine, fig flavored ravioli, and tomato bread salad were very good; cherry and meringue dessert with whipped cream was excellent",
    "No specific food quality feedback provided",
    "Calamari was salty, food quality consistently not great",
    "Salads and prosciutto with melon were lovely, sous vide beef was tender and delicious, though the special rib eye was disappointing",
    "Good clean and tasty food, interesting daily specials, genuine Italian food",
    "Ravioli was delicious, steak was full of gristle and difficult to cut",
    "Outstanding food with delicious arancini, risotto, and an exceptional chocolate dessert",
    "Fresh pea risotto with crispy pork belly was delicious, menu offers interesting and non-traditional Italian dishes",
    "Food is excellent",
    "Food was disgusting",
    "Risotto dishes and rotating specials are loved, tortino di nocciole dessert is excellent",
    "The gamberi salad with shrimp, white beans, and arugula was great, beet and grapefruit salad with goat cheese was good, calamari was not great, super Tuscan wine was fabulous though pricey for a small pour.",
    "Food is incredible",
    "Food is superb",
    "Food is outstanding",
    "Excellent delicious meal with special appetizers, salads, and entrees",
    "No clear food or service quality review provided in this statement.",
    "Every dish was fresh and perfectly prepared",
    "The menu is authentic, varied and cycles with the seasons, with carefully selected and prepared ingredients",
    "Fresh and delicious Caprese salad with good tomatoes, excellent pasta dishes, peach pastry with vanilla gelato was outstanding",
    "The food was fantastic!",
    "Steak was flavorless, bland and overcooked",
    "Excellent food",
    "No clear food or service quality review provided in this statement.",
    "Authentic and local inspired Italian cuisine.",
    "Food was delicious, specifically mentions enjoying the Tonatto",
    "Panzanella salad and Bolognese were amazing",
    "Traditional Italian food with good menu selection accommodating vegetarian and gluten-free diets",
    "Food is interesting, creative and unusual",
    "Food was excellent based on waiter's recommendations",
    "Great food, interesting menu",
    "Panzanella salad, Cacio e Pepe, and grilled calamari were all perfectly executed, delicious food",
    "Food quality is positive",
    "Real and authentic Italian food, great food",
    "Food lacked seasoning and flavor, did not meet expectations despite appealing presentation",
    "Anchovy appetizer, neri di sieppe, and rockfish were standout dishes",
    "Best lunch on either side of the Bay for months",
    "Excellent food",
    "The wine list was extensive and tasty; pastas were delicious.",
    "Food was delicious, particularly the dark chocolate mousse/ice cream dessert which was exceptional",
    "Food was excellent, entrées were perfectly prepared, desserts were outstanding",
    "Food was not up to par",
    "Authentic Italian food",
    "Food is interesting, tasty, beautifully presented and served in a timely manner",
    "Food was just ok, overpriced for the portion size",
    "",
    "Menu lacks variety and creativity, food quality does not justify the high prices",
    "Food was too rich, wine was excellent, had Branzino and seafood pasta, polenta side was exquisite but too rich",
    "Wonderful handmade pasta",
    "Food is interesting with good dessert",
    "Food was well-prepared and flavorful overall, but the linguini dish was disappointing with minimal seafood content (one shrimp, meat of two mussels, no clams) and small portion size",
    "Varied menu choices",
    "The menu is diverse with interesting options and daily specials, all dishes are thoughtfully conceived, brilliantly executed, and beautifully presented",
    "Food was great - specials were fresh, mains were flavorful, calamari spaghetti was good, anchovy appetizer recommended",
    "Several small plates and pastas were loved, wonderful red wine from Sardinia",
    "Shrimp salad had perfectly cooked shrimp, local fried anchovies were tasty, mushroom dish was underseasoned",
    "Food quality lacks proper seasoning and flavors despite good ingredients and menu selection. Dishes are bland and need more salt.",
    "Food is excellent, calamari and octopus dish is very good, pasta is delicious",
    "Wide variety of appetizers and mains, delicious Italian food, delicious desserts",
    "Walk in the garden cocktail is excellent, pasta is perfectly al dente with cacio e pepe being beautiful, Pollo and Branzino main dishes are favorites",
    "Food is well-prepared, pasta and octopus were delicious, dessert (pavlova) was hard and tasteless",
    "Food is top notch, uovo salad is perfect, all pastas are excellent including specials",
    "Never had a bad dish, several dishes are truly memorable",
    "Excellent food, gluten free fried anchovy special was great, shrimp salad had amazing shrimp, exceptional branzino",
    "Excellent food",
    "Delicious food",
    "Delicious appetizers, pasta and pizzelle",
    "Food is outstanding",
    "Food was excellent - gluten free spaghetti with bolognese sauce, tortino, golden beet, red grapefruit and ricotta salad were fresh and delicious",
    "Amazing Italian flavors, some of the best dishes",
    "The prosciutto di Parma & housemade ricotta & Parmigiano-Reggiano ravioli with roasted walnut sauce, zante currants, and figs \"saba\" reduction was complex and flavorful, with perfect portion size.",
    "Food is excellent, particularly highlighting the spring special asparagus flan appetizer as exceptionally delicious",
    "Pasta portions were small for the price",
    "Food quality not worth the price",
    "The tortino and the Sicilian caponata were fabulous!",
    "Food was incredible",
    "Food delicious",
    "Amazing pasta, Cacio de Pepe recommended",
    "",
    "Excellent food and drinks",
    "Creative mini pizza bites appetizer, excellent roasted asparagus, delicious salads and pasta dishes, all dishes tried were satisfactory",
    "Great Italian food, well-prepared and presentation. The menu has many excellent choices",
    "Excellent food",
    "Delicious authentic Italian food",
    "Homemade pasta was undercooked (under Al dente), Cacio pepe used non-traditional cheese blend of grana padano and pecorino instead of pecorino romano",
    "Risotto was fantastic; ribeye special was slightly overcooked",
    "Two diners had ravioli with mushy and boring filling",
    "I apologize, but I don't see any specific food or service review content in \"Celebration of life\" to extract information from. Please provide a review that contains details about food quality and service experience.",
    "Food was less than mediocre, tasteless rack of lamb, seafood in spaghetti was not fresh, poor quality for the price",
    "Delicious cuisine, imaginative cocktails with traditional Italian spirits, fantastic beer and wine menu, decaffeinated affogatto dessert",
    "No food quality review provided",
    "Salumi appetizer was excellent, branzino was wonderful, and the oxtail risotto was delicious. Good drinks and nice wine list with good values.",
    "Reliably good pastas and very good cocktails",
    "All dishes sampled were delicious, risotto with braised oxtail was tender and flavorful",
    "The food was amazing good, described as the best of Italy in the Bay Area",
    "Food was perfect",
    "Many items to choose from, all fresh and good",
    "Half chicken and taglialini were delicious, tasty cocktails and good Italian wines",
    "All menu items tried were well above average compared to other Italian restaurants in the area",
    "Delicious dinner",
    "Excellent food, excellent bar menu featuring craft cocktails",
    "Interesting Italian menu with fresh salad that was appropriately dressed",
    "Food was good overall - fried pizza, salad (without dressing), cacio e pepe was good but small portion, could have had stronger pepper and cheese flavors",
    "The food, especially the pasta dish, was mediocre",
    "Food was decent but uneven in execution; bread was mediocre",
    "No clear food or service quality information provided in this review.",
    "Food was prepared well and portions were of a nice size",
    "Food and specialty drinks were amazing",
    "The food is just great",
    "Great food",
    "The food is really good",
    "Good food, portions were small but hearty",
    "Excellent pasta, cocktails and wine",
    "Perfectly prepared food",
    "Food is consistently excellent.",
    "No specific food review provided",
    "Amazing food",
    "No specific food review provided",
    "Excellent cocktail \"Anna's surprise\" with fruity and cardamom notes, delicious Spaghetti Neri with squid ink pasta and spice, well-prepared Calamari with eggplant caponata, decadent cioccolato e cioccolato dessert",
    "Bread basket was tired, squid was tough, spagatoni with sausage pasta special was delicious",
    "Food is outstanding, with excellent choices for all courses, everything is home-made including desserts, jams, jellies, biscotti, crackers, sauces, olive mixes and caponatas",
    "Great drink and food",
    "Gamberie salad is generously portioned, risotto with oxtails has tasty sauce",
    "Seasonal food prepared lovingly and beautifully",
    "Solid homemade Italian food",
    "No clear food or service quality information provided in this review.",
    "Food was good, quality was good",
    "Food presentation and flavor were excellent",
    "Delicious food - beef tartar with bone marrow, arancini, squid ink pasta and root veggie salad",
    "Fresh pastas and superb salads",
    "The food was a delight with good ingredients, creatively prepared and tasty. Each dish was appealing, featuring unique items like sunchokes (Jerusalem artichokes) that were crispy outside and moist inside. Nice selection of Italian wines.",
    "Great food",
    "Fabulous regional menu with expert preparation and freshest ingredients",
    "tasty, imaginative food, much of it house made and organic",
    "delicious food",
    "Food was generous, creative, and delicious",
    "Wonderful dining experience",
    "Creative and inspiring Prix Fixe menu with remarkable dishes",
    "All courses are creative and consistently good, with amazing desserts",
    "Truffle ravioli was memorable and dream-worthy",
    "Food was creative and delicious, portions were generous with enough leftovers for another meal",
    "Food: Innovative appetizers with fresh ingredients, hot seafood salad with shrimp, octopus, and tuna, sausage medley in puff pastry, ravioli with shaved truffles in light cream sauce, homemade tagliatelli, branzino, chocolate salami dessert with mascarpone cream, berry and tomato dessert with mascarpone cream and grappa.",
    "Consistently best Italian food",
    "Food was excellent, shrimp salad and calamari were fresh and well prepared.",
    "The stew was delicious and everything was fresh and nicely done.",
    "Great cocktails, delicious prawn salad and tortelloni, excellent Barolo wine",
    "The prix fixe Christmas Eve menu was a generous celebration of seafood",
    "Menu choices were reasonably priced with fine variety",
    "Delicious food",
    "Seafood stew was delicious, specialty cocktails for the holidays were tasty",
    "Great food with good taste and presentation, very filling",
    "Yummy food",
    "Polenta was good, pork sous vide was bland and mediocre, hazelnut cake was dry, spaghetti nero was fine but not exciting",
    "No specific food review provided",
    "The food was delicious",
    "The food was great",
    "No clear food or service quality information provided in this review.",
    "Stuffed Quail with bacon, two types of mushrooms, and salad were amazing; thick pasta noodles cooked al dente with moderately spicy and savory marinara sauce was utterly amazing",
    "Pasta was overcooked with watery sauce, dishes were too salty or under seasoned, appetizer of chicken livers and quince jam was good, bread was odd",
    "Food: Stuffed quail was outstanding, winter root salad was outstanding, bolognese was excellent, bone marrow steak tartare was excellent. Rigatoni was undercooked. Dessert was nice but nothing special.",
    "Food was excellent",
    "Quail was enjoyable, pasta is fresh with interesting and authentic dishes",
    "Poor quality food with small portions",
    "Food was good but not outstanding as per usual standards",
    "Delicious drinks, creative menu",
    "Excellent food",
    "Delicious, fresh ingredients, homemade pasta",
    "Food was excellent, radicchio salad was just ok",
    "Food and drinks were tremendous",
    "Arancini and prosciutto were good, quail stuffed with sausage had limited meat and mushy, uninteresting sausage, rigatoni dish was described as \"weird\" with unusual plating",
    "Food was rated good to just ok, nothing spectacular",
    "Horrible appetizer, tough to cut, stale bread",
    "Food portion was small, pasta lacked flavor",
    "Branzino, Beef marrow, and Pinetti appetizers were delicious and complemented each other well. The Branzino and Papardelle were phenomenal. Desserts including Panacotta and gelato were delightful.",
    "",
    "Food is consistently excellent with house-made pasta",
    "Great food",
    "Solid Italian food",
    "Food was excellent",
    "Not enough information to extract specific details about food or service quality.",
    "Food was delicious, including Branzino, Pork Chop, vegetarian pasta, appetizers, and multiple desserts",
    "Food and cocktails were enjoyable",
    "Food is excellent",
    "Main courses were well-prepared and tasty with appropriate portion sizes; side salad was dried out, lacked dressing, and overpriced at $10",
    "Creative food with occasional misses, Cacio e pepe was too salty with excessive sauce ratio to noodles, Bolognese was fantastic, excellent salads",
    "Delicious main dishes but disappointing and not tasty salad",
    "The menu is well thought through, enticing and everything ordered was delicious",
    "Fresh pasta was great; clearly fresh",
    "Food and beverage menus are diverse with interesting options; dishes were superb, cocktails delicious, and wines as described",
    "No specific details about food or service quality were provided in this review.",
    "Outstanding food, best Italian in the US",
    "Great food",
    "Pasta dishes were excellent, appetizer was disappointing",
    "",
    "Fairly unique Northern Italian cuisine that can be top notch if you choose well",
    "The pasta dishes (special with chanterelles, capelletti, and calamari ink pastas) were wonderful, salads and desserts were also enjoyed.",
    "Food keeps getting better",
    "",
    "The food was outstanding",
    "Mediocre food with little flavor",
    "Food was delicious",
    "Exceptional traditional Italian restaurant with excellent choices for appetizers, salads and main courses. Italian wine selection is well matched to the food.",
    "Consistently great food and drinks",
    "No specific details about food or service quality were provided in this review.",
    "Tasty food",
    "Excellent Italian dishes including Arancini, cappelletti ravioli, cacio e Pepe, and Tortino's dessert with hazelnuts",
    "Every bite was delicious.",
    "No clear food or service quality information provided in this review.",
    "Good food",
    "Food was disappointing - Panzanella appetizer was subpar, Miale pork chop was poorly seasoned and bland, martinis were not properly chilled and under-filled",
    "Food is excellent",
    "Spaghetti was fine and plentiful, minimal sauce, small portion of calamari, tasty tomato slices",
    "Food was great",
    "Every menu item was delicious",
    "Food is excellent",
    "Food is delicious with spectacular presentations",
    "Food quality comparable to high-end local restaurants",
    "The cuisine was delicious with good sized portions",
    "Amazing food",
    "Delicious pasta",
    "No clear food or service quality information provided in this review.",
    "No relevant food or service quality feedback provided in this review.",
    "Risotto was especially good, great Italian food",
    "Exquisite pasta with much flavor, beautiful presentation, delicious charcuterie platter",
    "Food was terrific with traditional preparations and outstanding quality",
    "great food with some new delicious dishes",
    "No clear food or service quality information provided in this review.",
    "Everything is very good, pasta is a standout, cocktails are excellent, uovo salad recommended",
    "The branzino had crisp skin and was perfectly deboned, served with complementary black rice and vegetables. The sauce enhanced the fish well. The steak and bolognese pasta were extremely enjoyable. The Parmigiano appetizer was exceptional.",
    "Food was poor quality - pasta was hard and heavy despite being homemade, sauce was extremely salty, branzino was poorly flavored and soggy",
    "Food was plain and unimaginative, limited to gluten-free penne pomodoro; no vegan options available; overpriced for the quality",
    "Nice menu options",
    "Delicious, well prepared food",
    "Food was bland and not well balanced in flavors, presentation was good",
    "Menu features simple yet elegant Italian dishes full of flavor; squid ink pasta and pork chop are juicy and delicious; smart wine list",
    "Food was fabulous",
    "Creative dishes, excellent wine",
    "Homemade pasta was light, but sauce was very oily. Limited vegan options, pasta dishes contain cheese and egg.",
    "",
    "Food was expensive but worth it",
    "very good food",
    "The food is excellent",
    "The food and cocktails are special",
    "Excellent pastas and pork chop, menu has unique Italian items, best Italian food around Berkeley",
    "Food is good but repetitive menu, specials are inconsistent, solid Italian cuisine but nothing exceptional",
    "Great cocktails, amazing menu",
    "Amazing food",
    "Great food",
    "Fantastic food",
    "The food was very good",
    "Not enough information to extract any specific food or service quality details.",
    "Great food and great selection",
    "No specific details about food or service quality were provided in this review.",
    "Bronzino and spaghetti Nero was to die for- best I ever had",
    "Extensive Italian menu with plenty of options",
    "Food was great",
    "Everything was really delicious and sooo fries",
    "The food is outstanding",
    "Food was delicious, including fried anchovies, prawns with arugula and cannellini beans, cherry tomatoes, roasted almonds in lemony vinaigrette. Italian white wine paired well with dishes.",
    "Food was delicious and elegantly presented",
    "Amazing pasta and scorfano",
    "Pasta, ricotta, burrata were house-made and enjoyable, cocktails were very good",
    "Good food",
    "Love the food",
    "Food was filling with appetizers, salad and entrees that resulted in leftovers",
    "Ricotta beet and grapefruit salad was absolutely fabulous, Bolognese was delicious, simple and fresh, Risotto with facade beans and pork belly was good but not as outstanding as other dishes",
    "Everything was really delicious and sooo fries",
    "The food is outstanding",
    "Food was delicious - fried anchovies were very good, prawns with arugula and cannellini beans, cherry tomatoes, roasted almonds in lemony vinaigrette was excellent, Italian white wine paired well with dishes",
    "Food was delicious and elegantly presented",
    "Amazing pasta and scorfano",
    "Pasta, ricotta, burrata were house-made and enjoyable, cocktails were very good",
    "Good food",
    "Love the food",
    "Food was filling with appetizers, salad and entrees that resulted in leftovers",
    "Ricotta beet and grapefruit salad was absolutely fabulous, Bolognese was delicious, simple and fresh, Risotto with facade beans and pork belly was good but not as outstanding as other dishes",
    "Food is delicious, lots of locally sourced ingredients (mushrooms from Shasta and local anchovies)",
    "Authentic well prepared Italian cuisine, nice wine selection and full bar",
    "Food was perfect",
    "Food only so-so",
    "Food was sub par and pricey",
    "Food lacked flavor and taste, lamb was tough and served medium",
    "Amazingly delicious",
    "Pork chop was awesome, great food",
    "Great food with a nice selection on the seasonal menu along with well chosen daily specials; fantastic pasta dishes",
    "Food portions were appropriately sized, authentic Italian cuisine, delicious wine",
    "Phenomenal food",
    "Food was incredible, espresso was impressive",
    "Everything is outstanding, desserts are fabulous.",
    "Great food, menu selections influenced by regional Italian cuisine",
    "No food review provided",
    "Hard to decipher comprehensive menu but food was very good with many options",
    "Always a homerun with the food",
    "No specific food review provided",
    "Food and drinks were amazing; grilled calamari is a must have",
    "",
    "Excellent northern Italian authentic cuisine",
    "Beautifully prepared plates, fresh ingredients, creative yet authentic recipes",
    "No food review provided",
    "Food was beautifully presented and very tasty",
    "Food is innovative and fresh, especially loved all the appetizers and starters",
    "No clear food or service quality feedback provided in this review.",
    "Food is good",
    "Squid ink pasta was chewy and dry, cecio de Pepe pasta was inedible due to over-salting",
    "The spaghetti neri was delicious, and the chicken liver pate was excellent",
    "Menu description did not match food served",
    "Good Italian food, nice wine",
    "Branzino, spaghetti neri and calamari were excellent, with good variety between dishes",
    "Not enough information to extract specific details about food or service quality.",
    "Delicious food",
    "Food was amazingly consistent, appetizers were great especially cod on polenta, main dishes terrific, hazelnut gelato was intensely flavored, delicious and made on site.",
    "This review does not contain any specific feedback about food quality or service.",
    "The chicken liver mousse was quite good",
    "Food great",
    "Everything was fresh, flavorful, and carefully prepared",
    "Delicious food with a menu that offers variety and new items",
    "Nice presentation of unique dishes",
    "Main dishes are very good but small in portion size",
    "Calamari with eggplant was delicious, branzino was bland but properly cooked, shrimp dish was simple but satisfactory, portions were moderate but satisfying",
    "Authentic food",
    "Food was excellent",
    "Food was ok overall",
    "Food was disappointing, bruschetta had limited tomatoes with flavorless sauce, bread was buttered French bread, main dishes were average, asparagus was too buttery and overly soft",
    "Food was served lukewarm, fish tasted fishy and wasn't worth the price, though appetizer was very good",
    "The food is terrific",
    "Awesome pasta, especially the Cappelli with cream sauce. The pork chop was excellent too.",
    "Food was mediocre at best",
    "Excellent ravioli with ricotta and prosciutto, indifferent potato-filled tarte, generous house salad",
    "Outstanding food",
    "Dishes lacked flavor, duck ragu pasta underseasoned, bruschetta made with seemingly canned tomatoes",
    "Food was excellent",
    "Real Italian food, reminiscent of food from Italy, loved the meal",
    "Incredible meal, superb cocktail",
    "Food quality was not as good as previous visits",
    "Fish dish is best, dessert is good",
    "Asparagus ravioli was delicious, mixed green salad had too much curly skinny kale, L'arancia dessert with cara cara orange sherbet in maple sugar cup was refreshing and delightful",
    "Bruschetta is worth a visit, good vegetarian food options available",
    "Food excellent but portions small",
    "Delicious fresh Italian food, farm to table style food",
    "The oxtail risotto is very good as are the ravioli dishes and the pear and endive salad",
    "Side salad was generous, fresh and good. Pork chop was very generous and excellent with mushrooms and polenta. Sea bass was good though lemon invaded the side dishes.",
    "Excellent food with freshly made, delicious pasta",
    "The risotto with oxtail had good flavor but contained an unfavorable ratio of bone and fat to meat",
    "Great food",
    "No specific food review provided",
    "House made charcuterie, pastas, great polenta, extensive wine list with wide variety of wines",
    "Great Italian food, solid wine list, excellent cocktails",
    "No specific details about food or service quality were provided in this review.",
    "Calamari with octopus was grilled perfectly and tender, lamb special was cooked well, napoleon dessert was firm with nice crust and less creamy",
    "Fantastic meal",
    "The food was excellent, especially the pastas",
    "Good solid meal",
    "Food was delicious",
    "Homemade pasta and branzino was perfect with lots of yummy options",
    "Food is excellent, wine selection outstanding",
    "The bruschetta with Marzano tomatoes and quince jam had excellent presentation and flavors. The chicken liver mousse was flavorful. The tagliatelle bolognese was overly salted.",
    "Food was delicious, portion size was small, one dish served cold",
    "Delicious and authentically Italian food",
    "Each discriminating diner loved their food",
    "Food was great",
    "Food was solid, flavorful, and authentic.",
    "None",
    "None",
    "The food is creative and well prepared, with things you don't typically find at Italian restaurants.",
    "",
    "Everything was imaginative and delicious",
    "Food quality is nice, Italian wines are good, desserts are fabulous, side dinner salad is bountiful and healthy",
    "Food was decent but not exceptional - bruschetta was good, pasta dishes (squid ink and Pappardelle Verde) were fine but not amazing, dessert with mascarpone cream and house made chocolate was wonderful and the highlight of the meal.",
    "Enjoyed the Salumi charcuterie board and bruschetta for appetizers, and enjoyed all dishes and two desserts",
    "Unique and yummy Italian food, including delicious vegan entree and dessert options that differ from typical Italian fare",
    "Portion sizes were appropriate and well-measured",
    "Consistently good food",
    "The burrata was exquisite, the beets with tangerine, ricotta, and pistachios delightful, and the cacio e pepe sublime.",
    "Incredible food with best ingredients, expertly made and presented. Tártara (savory flan) appetizer was heavenly. Pasta Verdi with wild mushrooms and handmade spinach pasta was divine.",
    "Food quality was good, pappardelle with mushroom medley was excellent, nettle salad and pate were bland and underwhelming, quince jam was good, pasta portion size could be larger",
    "The food at Donato's was delicious from first bite to last",
    "Will have a good meal",
    "Great food",
    "Food was good.",
    "Seabass was perfectly cooked, one side dish was excellent, artichoke side dish was wooden, unripe and inedible",
    "Entrees contained excessive fat in the meat",
    "Small plates were good, lamb shank with mashed potatoes was delicious, desserts were not impressive",
    "Interesting cocktails, shared radicchio pear salad, calamari dish had excessive peppers, pork chop with polenta and wild mushrooms was good but needed less mushrooms and addition of greens, pasta dishes overpriced.",
    "Delicious Italian food",
    "No clear food or service quality information provided in this review.",
    "Menu offers variety of options",
    "Great menu, loved our meal, yummy cocktails",
    "The arancini and salt cod were great appetizers and the ravioli was fresh and delicious.",
    "Delicious house made pasta dishes",
    "One dish was overcooked, pasta dish was underwhelming",
    "Outstanding, delicious, creative, fresh food",
    "Two pastas were too salty and one pasta lacked flavor",
    "Good food",
    "Food was excellent with special mentions of Ravioli con Tartufo Nero, Tagliolini con Quaglia e Carciofi, Tortino, Bistecca, Risotto with oxtail, Frittelle & Crostoli special, and pistachio ice cream. Menu accommodated pepper sensitivity well.",
    "Food was great, pasta is freshly made, excellent sauces, ribs fell off the bone, desserts are great",
    "Meals were amazing",
    "The bolognese was very good, and the rigatoni with black olive crumble was notable",
    "Food was excellent",
    "Food was spectacular",
    "Real authentic Italian cuisine",
    "Wonderful food",
    "Beautiful creative food",
    "Ravioli was drowning in olive oil which affected the sage butter flavor",
    "Food is not great and expensive, quality does not match the price",
    "Authentic Italian food",
    "Delicious pasta",
    "Great Italian food",
    "Delicious dinner, great drinks",
    "Great dinner",
    "Great food",
    "Food was enjoyable",
    "Fabulous food",
    "Delicious food",
    "Had a nice pasta",
    "Outstanding gorgeous Italian cuisine",
    "Food was not as good as expected",
    "Food was delicious with homemade raviolis featuring light, thin pasta filled with prosciutto and ricotta. The walnut sauce was rich and tasty, complemented by zante grapes and zaba sauce. The pork dish was well-prepared, not overcooked.",
    "No specific details about food or service quality were provided in this review.",
    "Wonderful food",
    "Food ok, not exciting but prosciutto appetizer is delicious, biscotti for dessert excellent",
    "Fabulous food, loved every dish",
    "Food is amazing",
    "Great food, delicious pasta",
    "Excellent food",
    "Food was excellent - Arancini and charcuterie were awesome",
    "Excellent tuna carpaccio, oxtail risotto, fresh strawberry sorbet with mini meringues and chocolate crumble",
    "No specific details about food or service quality were provided in this review.",
    "No clear food or service review provided in this feedback.",
    "No specific food or service quality information provided in this review.",
    "House smoked trout salad was ethereal with delicious accompaniments",
    "Food was tasty",
    "Sensational, authentic and inspired Italian cuisine",
    "Food left me a bit disappointed",
    "Food exceeded expectations",
    "Excellent food, good cocktails",
    "No specific details about food or service quality were provided in this review.",
    "terrific, authentic Italian food",
    "Food is always delicious",
    "",
    "Food not specifically reviewed",
    "Creative, flavorful, beautifully prepared Northern Italian food",
    "Food was so good",
    "",
    "Food was fantastic",
    "Amazingly delicious meal with well-balanced and innovative flavors",
    "Food is wonderful",
    "Food is exceptional and consistent, particularly the squid ink pasta and lamb chop",
    "Food was delicious, including shared UOVO salad, bread basket with assorted breads, RIGATONI with eggplant and shrimp, and TAGLIATELLE with Bolognese sauce. Portions were generous.",
    "Excellent food",
    "Tasty food",
    "Excellent food",
    "Rock fish special was excellent, desserts are good particularly the hazelnut cake with gelato and chocolate sauce",
    "All food items were superb, particularly the Cacio e Pepe which was exceptional",
    "The pasta was excellent",
    "Food is always delicious and often surprising. Wine list and wine recommendations impeccable.",
    "Delicious lunch",
    "All dishes (arancini, cappelletti, pizzelle, bistecca) were enjoyable, seasoning was well-balanced, Sbrisolona e crema dessert was unique and excellent",
    "Food was good but too salty",
    "Authentic Italian food",
    "Food was delicious, fresh, perfectly seasoned and cooked; insanely great dessert; best coffee",
    "The food was amazing",
    "No specific details about food or service quality were provided in this review.",
    "This review does not contain any specific feedback about food or service quality.",
    "Great food",
    "Food is top notch",
    "Food was very nice - bruschetta, squash tortellini, Branzino (fish was the best dish, flavorful with black rice & mixed vegetables), and prosciutto ravioli",
    "Really good food",
    "Bruschetta and Tortellini were wonderful",
    "Delicious salad, appetizers, pasta, wine and desserts",
    "Not enough specific information about food or service quality to extract a meaningful review.",
    "Food is consistently well prepared, flavorful and beautifully presented",
    "Food is great, authentic Italian cuisine using fresh local ingredients, delicious tagliere di prosciutto with tigelle, good Pizzelle, excellent wine selection",
    "Spectacular pork chop with excellent flavor and presentation.",
    "No clear food or service quality information provided in this review.",
    "The branzino, homemade ricotta and beet salad were superb. Cocktails are really well done.",
    "Spaghetti with buratta and Calabrian pepper sauce was superb, duck ragout on house made fettuccini was fantastic, pork chop is a reliable dish",
    "Food was pleasing to the guests",
    "Meal was excellent",
    "Food is excellent",
    "The food and its presentation was very good, accompanied by an excellent red wine",
    "Food was great",
    "",
    "The arancini with sweet fennel salad were good but bland; bruschetta had non-crispy bread and tomatoes tasted like tomato paste; pizzelle trio was overwhelmed with tomato paste sauce; Brussels sprouts were overcooked and only seasoned with pancetta.",
    "Appetizer was very good, entrees were horrible with cacao e Pepe sauce not emulsifying causing Parmesan to clump at bottom, other pasta dish was mediocre, desserts were good",
    "Salads, pork and chocolate dessert were well done",
    "The food is divine",
    "No clear food or service quality information provided in this review.",
    "Menu offered diverse options, excellent tigella platter with prosciutto, creamy duck liver mousse, mussels in savory tomato sauce, grilled shrimp, Sbriciolone dessert with custard and almond cookie crumble, and affogato",
    "Great food",
    "Delicious pastas and salads",
    "Delicious food",
    "Delicious mussels, variety of appetizers, imaginative cuisine",
    "Excellent dinners, particularly the spagetti neri (calamari and squid ink), though several main dishes were too salty",
    "Charcuterie plate was average, baccala with polenta was good, branzino fish was good with excellent black rice, squid ink pasta was heavy with minimal calamari, chocolate dessert was good",
    "Pork dish was tough, seabass was excellent",
    "Salad was only fair and meat entree was tough",
    "Food is absolutely delicious, pastas are fantastic, specifically cacio e pepe and ravioli",
    "Food is fabulous",
    "Mostly excellent food, fabulous desserts",
    "Great food, specials were awesome",
    "The food is excellent",
    "Great meal",
    "Dinner was excellent",
    "Food was perfect",
    "The food was delicious",
    "Outstanding food",
    "Food was very, very good. Wine chosen was highly praised.",
    "Authentic Northern Italian food, great wine list and cocktails",
    "Super tasty, creative Northern Italian food",
    "Food was quite good and cocktails were well made",
    "Menu variety, deliciously prepared",
    "Menu is excellent but lacks variety in appetizers and bar bites; no warm or roasted olives available",
    "The branzino and Bergamo style ravioli with brown butter sauce are over the top",
    "Terrific appetizers (uovo and ricotta) and entrees (calamari and branzino)",
    "Food was interesting",
    "Delicious food with an amazing menu selection",
    "Food was incredible",
    "It is a piece of Italy!",
    "No clear food or service quality information provided in this review.",
    "Everything is rich with flavor and nicely presented.",
    "food was incredible",
    "Consistently delicious food",
    "No specific food quality review provided",
    "No specific food quality details mentioned",
    "Great chicken liver mousse, wonderful pasta, nice desserts",
    "Authentic and well-executed food",
    "Delicious food",
    "This review does not contain any specific information about food or service quality to extract.",
    "Food was amazing",
    "House made pasta was excellent",
    "",
    "Entree dishes are delicious and best choices. Pasta dishes are also great but they are not as good value",
    "Outstanding food, chicken liver and pears appetizer was especially enjoyable",
    "Calamari plate is excellent and beautifully presented; overall food quality is good",
    "The Seabass and Steak were not very good, food quality was off",
    "",
    "Food is interesting with diverse menu covering beef, chicken, fish, pork, and pasta options. Sides and appetizers are terrific. Specials are good value.",
    "Food did not meet expectations",
    "Good food",
    "Dinners were delicious",
    "Delicious food, generous portions",
    "Food is fabulous, particularly the Branzino",
    "Delicious food",
    "Great food",
    "Food is absolutely wonderful, authentic, creative and made with top-quality ingredients",
    "Food was amazing",
    "Great food",
    "Food was excellent with good value, mussels served in tomato broth had perfect level of heat, nectarine tart was excellent",
    "Food is remarkable",
    "Food was very good",
    "Food was wonderful",
    "Great food",
    "Wonderful food, beautifully prepared and presented",
    "The food is amazing",
    "Food was delicious",
    "Had the best meal, delicious, drinks were good",
    "No specific details about food or service quality were provided in this review.",
    "Great food",
    "Food was special with unique touches, fantastic and thoughtfully crafted cocktails",
    "Food was a little dim, pasta dishes were too salty except tortellini, green pasta had odd flavor and was soupy, charcuterie of salami was enjoyable, branzino was good.",
    "Food is Excellent",
    "House-made pastas with savory sauces, house-made charcuteries was bland, pasta dishes were very good, pork chop was cooked to perfection",
    "Tasty food overall, anchovies pasta was too salty, Bronzino was amazing",
    "Rib eye and branzinno were very nice, green beans were not satisfactory, broccolini was provided as replacement, excellent wine list",
    "Excellent food",
    "Upscale food with interesting and unique Italian menu",
    "The food was absolutely outstanding.",
    "The food was delicious and ample, with enough for leftovers",
    "The uovo salad was excellent and maintained its quality even after the pandemic break",
    "Arugula salad with shrimp was very good, calamari was burned, pork chop was overdone and tough, coffee was excellent",
    "Excellent food",
    "Each dish was delicious and unique",
    "Food was too salty, including tapenade; string beans were overcooked",
    "Food was superb, fantastic",
    "Food was outstanding, particularly the branzino was spectacular",
    "Superb food with excellent wines, cocktails & beer",
    "Food was excellent",
    "Terrific pasta made in house, with 3-4 daily specials available",
    "One of the very best true Italian restaurants in the Bay Area",
    "innovative dishes",
    "Food was authentic Italian with perfectly balanced dishes, including house-made ricotta used in various pastas and appetizers. Three appetizers and two pasta dishes, including Chef Gianluca's special, were all expertly prepared with perfect balance of flavors.",
    "Delicious food, appetizers were terrific and pasta exceptional. Good drink and wine selection.",
    "Food was very good, good value, house made pastas were enjoyable, wine by the glass selections were nicely curated and fairly priced",
    "Quality ingredients with excellent food preparation",
    "Excellent food",
    "Food is fun and good",
    "Appetizers were filling",
    "Food is clearly made with care, bringing the best of Italian cuisine in fresh and imaginative splendor",
    "Delicious food",
    "The food was well prepared with generous portions suitable for sharing. The bacalao fish appetizer was excellent. Pasta, fish, squid, and pork chops were all nicely prepared. Pana cota dessert was served.",
    "Yummy, creative and ample dishes, perfect for tasting and sharing.",
    "Fabulous desserts, bread and olive tapenade excellent, CICCHETTI not impressive, sole was good, tuna wasn't great",
    "Great food",
    "Thoughtfully prepared rustic Italian dishes, Branzino was nicely seasoned and cooked perfectly",
    "Food is always delicious",
    "Food was mostly good but a la carte options were better than prix fixee menu",
    "No clear food quality or service review details could be extracted from this comment.",
    "Superb black truffle special menu",
    "Steak was cooked perfectly, served with a green sauce with rosemary, excellent Italian wine selection",
    "Delicious pre-dinner cocktails, tasty fried risotto balls, fresh salads, perfectly cooked pasta authentic to Italian style, well-prepared pork chop and chicken dishes",
    "Excellent food",
    "Food was so good",
    "This review does not contain specific information about food quality or service.",
    "Authentic Italian food",
    "Great food",
    "Food was a bit salty but still tasty.",
    "Everything is delicious",
    "Terrific food",
    "Food was delicious",
    "Inventive versions of classic Italian food, fine food at pre-Covid high standard",
    "Food was good but portions were extremely small, only filling about a quarter of the oversized serving plates.",
    "Food was delicious",
    "Fresh ingredients, imaginative preparations",
    "Superb food and wine",
    "The Italian food was excellent with many wonderful menu choices",
    "Authentic Italian cuisine",
    "Food was delicious but slightly salty (Branzino and steak)",
    "Food was good overall but too salty, dessert was enjoyable",
    "Food was not up to par",
    "Food was very good, interesting and unusual menu, enjoyed vasetto and little pizzas, olive tapenade with bread was good, hazelnut dessert was fabulous",
    "Excellent food, roast chicken",
    "Great food",
    "Food very unprofessional and uninteresting",
    "Excellent menu, ingredients, preparation and presentation",
    "No specific details about food or service quality were provided in this review.",
    "Great food, very fresh, large portions even for appetizers",
    "Food was fabulous",
    "No clear food or service quality information provided in this review.",
    "No specific details about food or service quality were provided in this review.",
    "Great Food",
    "Excellent meal, loved the Vasetto (chicken liver mousse) and the Branzino",
    "The food was delicious",
    "Traditional Italian food made with love",
    "Wonderful food, great drinks",
    "Excellent food",
    "Excellent al dente pasta with clams, an evening special. It evoked memories of Rome.",
    "Incredible pasta, fantastic salumi plate",
    "Delicious food and wine",
    "Food was great",
    "No clear food quality review provided",
    "Food was solid - pasta dish was enjoyable, fish dish was considered average",
    "Food was good, though prices are a bit high for the food served",
    "Superb food, wines & desert",
    "Foods are good",
    "No specific details about food or service quality were provided in this review.",
    "Food was better than pre-pandemic, cocktails were great (French sidecar), Gamberi salad was perfect with well-cooked prawns, cicchetti plate was gorgeous, branzino main was enjoyable, desserts were delicious particularly the hazelnut cake",
    "Antipasti were good, pasta was too salty",
    "No food review provided",
    "Great food with great presentation",
    "Not enough information to extract specific food and service quality details from this review.",
    "Delicious and creative Italian dishes, salads were too creative, preference for crisp French/Italian bread instead of squishy focaccia",
    "No food quality information provided",
    "Excellent food, accommodating for vegetarian and gluten-free diets",
    "Pasta sauce was first class, felt like being in Bologna",
    "Food was excellent and inventive, enjoyed salad, appetizer and entrees paired with Pinot Noir",
    "Food came quickly",
    "Creative, tasty Italian-esque food with unexpected flavor combinations, nicely prepared and presented",
    "The food was excellent",
    "Food was great",
    "Excellent food",
    "Food was excellent",
    "No food or service quality information provided in this review.",
    "This review lacks specific details about food and service quality to extract meaningful feedback.",
    "No food or service quality information was provided in this review.",
    "Food was excellent, Branzino special was great, pasta and appetizer salads were terrific",
    "Loved the food",
    "Rib eye steak was cooked to perfection, served with delicious potatoes and asparagus, accompanied by black salt",
    "Pork dish was good but could use more flavor; unique meal offerings",
    "Quite enjoy the food",
    "Over cooked fish, tasteless pasta, overall very mediocre",
    "No clear food or service quality feedback provided in this review.",
    "Food is just okay, more like cafeteria food",
    "Unusual Italian food, delicious, generous serving of polenta",
    "Very good food, special requested dish was accommodated, cappuccino was average",
    "The food was delicious across all courses including starters, pasta, main, and dessert - authentic Italian quality comparable to dining in Italy",
    "Great food and big servings",
    "Delicious food, interesting cocktails",
    "Food was wonderful, diverse menu from small plates to grilled meats and vegetarian options, homemade pastas not drowning in red sauce, authentic Italian dining",
    "Food was disappointing - bruschetta unremarkable, steak was gristly, Cacio e Pepe pasta was terrible",
    "Food good",
    "Fresh pasta, creative dishes, incredible food",
    "Charcuterie had old-smelling meats, pasta was undercooked and cold, bread was not fresh",
    "Salumi plate and burrata were loved, fave bean pasta was tasty with a lovely light broth",
    "Food was overpriced",
    "Pasta was overcooked",
    "Food is very good, uncomplicated but well executed with high quality ingredients. Drinks are very good, particularly the 1840 traditionale.",
    "Food was excellent with several meat-free options, house made pasta was cooked perfectly",
    "Food was novel and tasty",
    "Food was fantastic",
    "Grilled calamari was fresh, juicy and flavorful; pasta had the right texture and not too creamy; side green salad was fresh, crisp and complex",
    "Food was great",
    "nice food",
    "Food is always good",
    "Authentic Italian food",
    "Delicious cocktails and food",
    "The menu and food were great, with tasty cocktails and a delicious bottle of wine (Tenutarossa's Montelpulciano D'Abruzzo)",
    "Fabulous food, northern Italy style, lovingly prepared",
    "Food was awesome",
    "Food was delicious",
    "This review does not contain specific information about food quality or service quality.",
    "Food was every bit as good as when we dined there indoors",
    "Food was delicious and portions were generous",
    "Wonderful food",
    "No food or service review details provided in this input.",
    "Rigatoni was undercooked and very bitter with green sauce",
    "Excellent food",
    "Food was wonderful with many vegetarian dish options",
    "Food and drinks were outstanding",
    "Food was delicious",
    "Food was excellent and authentic, appetizers were excellent",
    "The meal was extremely good, pork needed more seasoning and vegetables, polenta was excellent",
    "Black pasta with calamari; perfectly cooked Florentine steak with roasted potatoes and broccoli rabe",
    "Great food",
    "The food was excellent, including burrata salad, small pizzas, pasta, and notably exceptional swordfish special",
    "No food review provided",
    "Very tasty Italian cuisine",
    "Good food",
    "Gamberi dish undercooked, Endive salad had strong unexpected anchovy taste, pasta dishes mediocre and lacked flavor",
    "Food was tasty, calamari was overcooked and rubbery",
    "Pizza was outstanding",
    "Food was truly delicious, truly authentic Italian",
    "Wonderful imaginative chef who offers the best in regional Italian cooking",
    "Good tasty food, not exceptionally amazing",
    "Food was excellent, with perfectly cooked prawns in the gamberi salad, appealing mix of greens and varied tomatoes, and well-prepared bruschetta loaded with diverse tomatoes.",
    "Calamari was tough with a bitter disappointing sauce",
    "Absolutely delicious food",
    "Great food",
    "Wonderful authentic Italian food",
    "Delicious food",
    "Pasta was hand-made, perfectly al dente, with well incorporated sauce",
    "Food was excellent, including great Prosciutto di Parma, lonzino (pork loin), plentiful and excellent grilled calamari, Vin Santo, and handmade Cantuccini di Prato",
    "Excellent and well thought out authentic Italian food",
    "Authentic yet unusual Italian food, excellent wine",
    "Food was outstanding",
    "Food was lovely",
    "Best Italian food, authentic cuisine",
    "Great flavors, quality food",
    "No food or service review available as the establishment was closed.",
    "Excellent fish, phenomenal hazelnut dessert, nice wine selection, salad could have been better",
    "Food was excellent, not typical Italian food",
    "Amazing food",
    "OUTSTANDING Italian food",
    "Fried white anchovies were divine, homemade pasta and braised pork were terrific",
    "wonderful meal",
    "Food is fine",
    "Delicious pasta dishes",
    "Great food, good prices",
    "It was really good",
    "Three different entrees were delicious; two yummy starters",
    "Food and wine was the best",
    "Great food",
    "No clear food or service quality information provided in this review.",
    "Everything recommended was fantastic",
    "Food delicious, squid with Dijon sauce highly recommended",
    "Food was mediocre, ink spaghetti pasta lacked flavor with minimal calamari, swordfish was mediocre, ordered broccoli was not delivered",
    "Food was excellent and reasonably priced. Nice menu selection.",
    "Well crafted and thoughtful combinations of flavors",
    "Duck was very dry, overcooked, and portion size was small",
    "Pasta was great",
    "Great place to eat",
    "Food was great",
    "Food is over the top delicious",
    "Excellent appetizer with salumi plate featuring duck, pork, and salumi with picked peppers and onion; perfect pasta dishes including cacio y peppe, ravioli, and bolognese; fantastic Zuppa inglese dessert; warm and wonderful bread",
    "The food is fantastic, with excellent squash tortellini, wood fired squid, and cauliflower with pesto",
    "Il cibo è meraviglioso",
    "Beautiful food",
    "Chicken was good, pasta dishes and risotto with ox tail were too salty",
    "Food was delicious, wine pours were skimpy",
    "Food has gone downhill",
    "Offers variety of common Italian dishes",
    "wonderful flavors",
    "I don't see any actual review content about food or service to extract from your message. Please provide a review that contains feedback about food and service quality.",
    "The food was tasty, portions adequate.",
    "Food portions are large, dishes are well thought out, varied menu, all dishes were excellent except the three small pizzas appetizer which was mostly dough",
    "Pasta dishes and desserts are excellent, particularly the Carbonara",
    "Some of best pasta ever",
    "Duck breast was fabulous",
    "LOVE the food, different and interesting",
    "Food was immensely enjoyable from start to finish",
    "Food is right on point",
    "Food was good but not exceptional",
    "Pasta was extra al dente and satisfying",
    "Food is delicious, though preference for salad over homemade potato chips",
    "Lovely food",
    "No specific food quality review provided",
    "Great food at good price point",
    "The bruschetta and squid ink pasta were outstanding",
    "Lots of savory flavors without the heavy tomato influence you usually find",
    "All courses were delicious and unique",
    "The charcuterie was exceptional and unique, made in-house. Entrees were authentic Italian dishes including roasted Duroc pork neck chops with grilled brussels sprouts and polenta, guinea hen stuffed ravioli in marsala sauce, grilled cauliflower, cacio e pepe, prosciutto di parma and ricotta ravioli, and pasta with liberty duck sugo. The desserts were delicious and well-balanced. The Italian wines (Brunello and Nebiola) were excellent.",
    "Food was really good, brunch and lunch menu items were quite pleasing, great dessert",
    "Caccio e Pepe was authentic and enjoyable; oxtail risotto had minimal meat content and mostly bones",
    "Great food",
    "Food is exceptional",
    "The special menu was excellent",
    "Mediocre dishes, ravioli had too-thick dough, odd food combinations on plate",
    "Food was bland and seemed like it had been made the day before",
    "Delicious food",
    "Food was awesome",
    "Lovely selection of authentic and homemade dishes, seasonally appropriate daily menu specials",
    "Nicely prepared swordfish",
    "Delicious food with many menu choices, including healthy options like shrimp salad",
    "Special crab pasta was extremely ordinary; duck portion was small",
    "Tough lamb shank",
    "Frittata was too salty",
    "The food is incredibly good",
    "",
    "Food quality varies - liver pate served frozen solid and later poorly microwaved, duck breast overcooked and chewy, crab pasta bland, but oxtail risotto and shrimp & veggie Frito were excellent",
    "Food is great including the daily special",
    "Food was flavorless, sea bass was overly salty and dry; desserts were disappointing",
    "Housemade pasta and salads were fantastic, desserts were unbelievable",
    "",
    "",
    "Excellent food",
    "Real Italian food created by an excellent chef",
    "Food was delicious",
    "No clear food or service quality information provided in this review.",
    "The Christmas Eve prix fixe dinner was delicious, and the Italian artisanal beer (A Modo Mio) was very fruity",
    "No food quality review provided in the text",
    "The shrimp in the salad were terrific, but the arugula salad was under-dressed and the combination with crunchy almonds didn't quite work together in terms of flavor and texture.",
    "Great food, wonderful selection of wine",
    "This review does not contain any specific information about food quality or service experience.",
    "Best pasta",
    "Fantastic Italian food",
    "Food was not as good as previous visits",
    "Food is very good",
    "Delicious food from appetizers through dessert",
    "Simple main dishes and desserts were satisfactory",
    "No clear food or service review provided in this feedback.",
    "Superb Italian food with a creative twist",
    "Food was consistently good with interesting drinks. Pasta with mushrooms was too vinegary and mushrooms were slimy. Branzino, burrata with peppers and tomatoes, and cod brandade over grilled polenta were delicious.",
    "Food is delicious",
    "Creative unique menu",
    "Food was delicious",
    "Food was barely warm, trout and Brussels sprouts served at inadequate temperature, flavors were unremarkable",
    "Food was outstanding, duck and \"black\" spaghetti were prepared to perfection, dessert was fantastic",
    "Good chicken liver mousse appetizer, mixed salad was underdressed, dessert of meringue, whipped cream & prune sauce was a nice light finish, wine list fine",
    "Mussels special, uovo salad, papardelle with wild mushrooms were superb, dessert was delicious",
    "Well seasoned food, good portions, variety of great Italian dishes",
    "No clear food quality or service review details could be extracted from this statement.",
    "Food was good",
    "Great food",
    "The food was delicious",
    "All food was delicious, particularly the beet and ricotta salad and red frilly greens salad which were engaging and tasty",
    "Food was creative and delicious",
    "Food was strange and not tasty",
    "No specific details about food or service quality were provided in this review.",
    "Excellent food",
    "Food was excellent",
    "No specific food review provided",
    "Food is terrific",
    "Wonderful selection of appetizers and entrees and the dishes were delicious!",
    "Cocktails were very good, arancini were super tasty, main dishes and appetizers were good but not amazing",
    "Food was great",
    "great meal",
    "The pasta is excellent",
    "Authentic food",
    "Frisée salad was delicious, tomato salad and calamari entree were good, pork loin was dry and tough, squash pasta was rich, Pistachio Semifreddo was excellent",
    "No specific details about food or service quality provided in this review.",
    "Excellent authentic Italian food, though pricey",
    "Creative and pleasant flavor parings, swordfish and black rice were notable",
    "No clear food or service quality information provided in this review.",
    "Delicious meal",
    "Salad with egg and pastas were delicious",
    "Food was good - pork special, lamb, salad, and pasta were all good quality. Great value for money with 3-course meal and wine.",
    "Food was oversalted in 3 out of 4 dishes served",
    "Food quality was excellent with well-prepared fire grilled Liberty duck breast served medium rare, impressive vegetable selections and preparations, good wine selection with Italian options",
    "Dishes were overly complex with too many elements",
    "No specific details about food or service quality were provided in this review.",
    "No specific food quality feedback provided",
    "Loved the dinner",
    "Food had good flavors but was rushed in execution; portions were small",
    "Great food",
    "Food was very good with well-presented dishes; sardine appetizer was fried without being oily; slow cooked wild boar and mushroom sugo was spectacular; squid ink spaghetti with calamari was tasty",
    "No clear food or service quality feedback was provided in this review.",
    "Food was very good with an interesting menu",
    "No specific food review provided",
    "Chicken in both chicken salad and fried chicken salad was tasteless and tough like leather",
    "Excellent menu",
    "No specific food quality feedback provided",
    "Donato's food is great",
    "Everything ordered was delicious, wine was superb",
    "Si mangia sempre benissimo, autentico ristorante italiano, chef riesce sempre a sorprendere, vino di ottima qualità",
    "Food was delicious",
    "Food is excellent with house-made pasta and salumi, authentic Italian culinary traditions, well-curated Italian wine list. Desserts were somewhat disappointing with too much deconstruction and lacking artistry.",
    "Food was outstanding - every dish",
    "No specific food review provided",
    "Food was enjoyed",
    "Very good food",
    "Original, authentic regional Italian food",
    "Entrees have excellent flavor, some side dishes or accompaniments are bland",
    "Rare quality food with excellent cooking",
    "Food was excellent",
    "Food is fresh, interesting and delicious; mussels were fat and juicy with wonderful sauce; pasta dish was loved",
    "Food is good",
    "Food was ok",
    "Great food",
    "Exquisite food",
    "Eclectic and delicious menu",
    "The food is creative and delicious",
    "Good variety in creative menu, satisfying food choice, preparation and presentation",
    "No specific details about food or service quality were provided in this review.",
    "The food was delicious and very fresh, with chef combining in season produce to create delicious meals.",
    "Really good food, great menu",
    "Food came out luke warm or almost cold",
    "All enjoyed their food",
    "No specific food review provided",
    "No clear food or service quality information provided in this review.",
    "Wonderful food",
    "Food was wonderful with unusual offerings, including a salad with ripe nectarines and a garnish of dehydrated, sugary thin orange slice that was delicious.",
    "Delicious and unique Italian fare",
    "The food is delicious and the cocktails and wine are devine.",
    "Entrees are hit or miss",
    "All dishes were delicious",
    "Several favorite dishes available, fresh anchovies served, lamb was perfectly cooked and flavorful",
    "The grilled calamari and octopus was scrumptious, along with the whole wheat pappardelle and funghi dish.",
    "",
    "Lunch was quite tasty",
    "Great food",
    "Chicken liver lacked flavor, calamari entree was delicious",
    "Food was delicious",
    "Food was exquisite, from salads to pastas to seafood.",
    "Food quality was mediocre during the latest visit, though previous visits had fantastic meals",
    "Delicious Italian food, wonderful wine and cocktails",
    "Excellent food",
    "Elegant, inventive use of local ingredients",
    "Everything was very fresh and tasty; delicious food; desserts were scrumptious",
    "No specific food review provided",
    "The food didn't feel thoughtfully prepared",
    "Swordfish dinner was served warm instead of hot",
    "Food is always terrific",
    "Imaginative take on Italian essentials, fabulous food",
    "Inspiring menu",
    "No clear food or service quality information provided in this review.",
    "Special pasta with mushrooms was good, ravioli was gummy and very salty, rigatoni with shrimp and pesto was very salty, eggplant and zucchini with tomato sauce was bland with mushy eggplant and bitter zucchini",
    "Food was delicious",
    "Not enough information provided about food quality or service to extract a meaningful review.",
    "Terrific food",
    "Great food",
    "Outstanding arancini in romanescu sauce, tomatoes and burrata was impeccably prepared & seasoned (though tomatoes could have been riper), gorgeous tagliatelle with fresh porcini and egg yolk was fresh and satisfying, exquisite branzino",
    "Food was delicious with generous portions, best arancini appetizer, pork neck chops were flavorful and tender",
    "Food was unusual",
    "No clear food or service quality review was provided in this feedback.",
    "Food not mentioned",
    "Outstanding food quality and originality; swordfish with black rice was wonderful, mussel appetizer and creme brulee dessert were terrific",
    "Food was authentic and seasoned mindfully",
    "Best Italian food, authentic Italian cuisine",
    "No specific food or service quality information provided in this review.",
    "Food is delicious",
    "Great homemade pasta",
    "The food is exceptional and authentic, with well-prepared basic dishes, fresh pasta, and quality locally sourced ingredients.",
    "The pasta and seafood were excellent, lovely selection of dishes representing Italian and California cuisine, chocolate dessert a classic for chocoholics.",
    "Food was great",
    "Food was very good",
    "Not enough information to extract specific details about food or service quality.",
    "Produce was not fresh, kale salad had many old, wilted, yellow leaves",
    "Excellent swordfish, perfectly cooked, nice sauce and accompaniments. Superb chocolate dessert.",
    "Not enough information to extract specific details about food or service quality.",
    "Excellent food",
    "Food is excellently prepared and carefully thought out",
    "I apologize, but I don't see any specific food or service review content in \"Much improved!\" to extract. Please provide a review with details about food and/or service quality for me to analyze.",
    "Food lacked flavor, unexciting, not authentic Italian cuisine",
    "Food was good, well seasoned and presented",
    "Poached eggs over potato/cheese pancake with bernaise sauce is excellent, frittata was loved, smooth and delicious cappuccino, good wine, fun cocktails",
    "Very good food with black truffle prix fix 3-dish menu and tasty dessert",
    "No specific food quality feedback provided",
    "The food never disappoints",
    "Menu is varied, cooking and presentation are excellent",
    "Not enough information provided about food quality or service to extract a meaningful review.",
    "Creative drinks, interesting wine list, diverse menu",
    "wanted to like the food",
    "Great food",
    "No clear food or service review provided in this comment.",
    "Wonderful meal, cacio e pepe highly recommended",
    "Food was excellent",
    "Appetizers and roasted items are especially recommended",
    "Fresh pasta, excellent authentic Italian food",
    "No specific details about food or service quality can be extracted from this single-word review.",
    "No food review provided",
    "Chefs platter was beautifully presented and delicious, fish specials were delicious and beautifully presented, homemade pasta is terrific",
    "This review does not contain specific information about food quality or service.",
    "Food was delicious and expertly prepared with reasonable portion sizes",
    "Crispy polenta egg dish had mushy polenta but tasted good; pancakes were served cold",
    "Salad had excessive lettuce, pasta was too al dente and clumped together",
    "Food took very long to prepare",
    "Exciting flavor combinations, very fresh seafood dishes, multiple small plates suitable for sharing",
    "Simple, fresh and delicious cacio e pepe and mixed salad",
    "Good food",
    "Great food",
    "The Gamberi salad was large and delicious with perfectly cooked shrimp and light, flavorful dressing. The Caccio e Pepe pasta had excellent flavor and was prepared authentically without unnecessary additions. The brussel sprouts side dish was nice though unremarkable.",
    "Tonnarelli carbonara had excessive sauce, salad was oversalted and inedible, grilled asparagus and Brussels sprouts were good, roast chicken was slightly dry, caponata was poorly prepared with incorrect ingredients and overpowering herbs, bread had soda-like taste, chocolate dessert was good but different from description.",
    "Unique flavors in regional Italian menu",
    "Delicious food",
    "The food is very good",
    "Great Italian food with quite a variety",
    "Delicious food and great prices",
    "Food was of great quality, simple dishes with high quality produce, excellent desserts particularly good and original, notable meringue",
    "Pizzele appetizer was enjoyable, good variety in appetizers, pasta, mains and desserts, food is nicely presented",
    "amazing chef",
    "Butter leaf lettuce salad was overdressed with heavy dressing and had brown bits; squid ink pasta with calamari was tasty but missing the Calabrian chili that was listed on menu",
    "Arancini deep fried risotto with cheese filling was served, squid ink spaghetti and grilled radicchio were very flavorful, reminiscent of Italian restaurants",
    "Food was not good - shrimp pasta was salty, chicken was simple and unremarkable, no complimentary bread basket served",
    "Squid ink pasta and ravioli were good but not special. Bread was very good as was coffee and espresso.",
    "Authentic and delicious food",
    "Food quality was poor with pasta being consistently hard and not properly cooked \"al dente\"; quality does not justify the high prices charged",
    "Authentic Italian food made with care",
    "Food wasn't as good as expected considering the price",
    "Brochette was good; calamari was overcooked; ravioli was overcooked; sauce was too salty",
    "The prawn appetizer with artichoke hearts and red lettuce was fresh and tasty; prosciutto pasta dish and white fish were delicious and well balanced",
    "Very delicious food",
    "Food was great",
    "Fresh, inventive, intense food",
    "Impeccable food, mussels and red frizee salad were loved",
    "Food was delicious with good wine selection",
    "Meal choices are a hit. Desserts are even better.",
    "Grilled octopus was perfectly cooked, ratatouille side dish was too salty and mushy",
    "Food was delicious and fresh",
    "Hearty pasta with great flavor, fresh bib lettuce salad",
    "Entrees and starter were delicious",
    "Delicious meal, especially dessert",
    "Food was excellent, fine quality",
    "",
    "Food was delicious, the steak was cooked perfectly, and the sides were amazing",
    "Delicious cauliflower dishes",
    "Appetizers were mediocre, chicken was dry and bland",
    "Lamb shank with mashed potato was good, fish mousse was bland and served with bland polenta, Pavlova-type dessert in a glass jar was delicious.",
    "Food was excellent with unique salads, mussels marinara, squid ink buckwheat pasta, potato & cheese frico cake with poached eggs & Béarnaise sauce, and fabulous desserts",
    "Radicchio salad and spicy sausage and shrimp rigatoni were excellent. Lamb shank was disappointing with rubbery meat that was hard to cut and chew. Mashed potatoes and gravy were great.",
    "The lamb dish was excellent with generous portion and tender meat that fell off the bone",
    "Simply excellent food",
    "Real Italian taste",
    "Menu is consistently great and delicious",
    "Grilled octopus and squid was delicious, rabbit tortellini was ok, ricotta cheese appetizer was excellent and melt in mouth, pana cotta was the best",
    "Food, cocktails and wine choices are great for the price",
    "wonderful Italian food",
    "Excellent and great fresh food, unusual excellent desserts",
    "Great food",
    "Fish is excellent, radicchio salad is good, shrimp and asparagus fritto misto perfectly cooked, panna cotta terrific with lemon and anise",
    "Simple food with quality ingredients, excellently prepared",
    "Food was fantastic, coffee was fresh and delicious",
    "Food was beautifully prepared and tasty, though portions were small",
    "Food is delicious except for bland buckwheat ravioli",
    "Northern Italian cuisine, pizzelle with crispy browned crust and excellent cheese melt, perfectly cooked al dente asparagus side dish, calamari dish needed more calamari, delicious cream dessert with crumbles",
    "",
    "Creative Italian menu with fantastic dishes including Arancini, Pappardelle, and Cacio e Pepe",
    "Octopus was unmemorable, succotash was interesting, polenta was extremely disappointing with no seasoning or sauce - just cornmeal and water.",
    "Fresh and delicious food, gorgeous salads, delicious small pizzas, house made bread and focaccia, delicious roasted tomatoes",
    "Food is bland and tasteless, pastas lack flavor and sauce, chicken is dry",
    "Food was delicious and beautifully presented",
    "Food was good but needed improvement - branzino was slightly overdone, plating lacked color contrast, buckwheat ravioli was enjoyable, beet and cara cara orange salad was lovely",
    "Food was amazing, accommodating to vegan dietary requirements",
    "Salads were very good, as was the chicken entree. The buckwheat ravioli was disappointing because the veggie stuffing had been marinated in vinegar; it gave the dish a sour unpleasant taste.",
    "Real Italian food, best wild boar pappardelle, excellent fish, outstanding desserts",
    "Very mediocre food, wasn't good",
    "",
    "Food is outstanding, drinks are fun and delicious",
    "I don't see any specific food or service review details in your message to extract. Please provide a review that includes feedback about food and service quality.",
    "Food is excellent, menu is interesting, great value for price",
    "Food was excellent with flavorful dishes including pizzelle (three different small pizzas), black squid ink spaghetti with calamari, grilled calamari, octopus with caponata, asparagus, and outstanding desserts made by one of the best pastry chefs in the Bay Area.",
    "Great cocktails, wonderful fresh pasta and homemade salumi",
    "The food was fantastic, beautifully presented, really delicious. Starters were super.",
    "Fish dishes were excellent, good starter salads, fabulous chocolate dessert, pasta was mediocre",
    "Food was too salty and tough, pork chop despite being marinated was tough",
    "Food was excellent, creative and appetizing",
    "Terrific food",
    "Food was good and very reasonably priced for the quality",
    "Food was great",
    "Food quality is excellent",
    "Pastas are incredible, pizzettes made from amazing dough",
    "Incredible food - authentic, made by Italians",
    "Good food",
    "Wonderful food",
    "Food is special",
    "Food was excellent, with offerings including three mini-pizzas, house-made sausage and polenta, and salad",
    "Chicken liver mousse was too creamy, Caci e Pepe tasted strange with an unusual flavor, food quality not as good as previous visits",
    "Trout, calamari, and cauliflower were outstanding, great wine list and cocktails",
    "Small portion sizes",
    "The food is great",
    "Unique menu, sea bream was delicious, pizzelle was delicious",
    "Outstanding food across starters, mains, and desserts, good value",
    "Interesting and reasonably priced menu",
    "Carnaroli Risotto was a bit tough along with the oxtail; Organic Cauliflower Bistecca portion size was too large for a main course",
    "Excellent imaginative food",
    "Great food",
    "Food was excellent",
    "Very tasty food, butternut squash spinach ravioli was excellent, good wine list",
    "No food quality information provided in the review",
    "Appetizers were ok, Cacio pasta was like glue",
    "Good comfort food, rich in taste",
    "Good selection of appetizers",
    "Liked the food very much",
    "Good food",
    "Great food",
    "No clear food or service quality information provided in this review.",
    "Great Italian food",
    "",
    "Risotto with oxtail was delicious, radicchio salad was limp and bland, linguini and clams was great but portions were small",
    "Food is slightly underwhelming but decent",
    "Radicchio Salad had little to no dressing and lacked taste, Lamb Shank and mashed potatoes were very tasty but accompanying radicchio was inedible, Spinach Ravioli was tasty, dessert (Chocolate Mousse with Chocolate Sauce and Blueberry Sorbet) was the highlight of the meal.",
    "All members of the party raved about the food's visual presentation and taste",
    "The food looks beautiful, but the flavor combinations were disappointing.",
    "Solid and tasty Italian food",
    "Steak was overdone, overpriced, under-salted with no distinct flavors. Cocktails were good.",
    "Delicious food",
    "Mediocre food, chicken liver appetizer tasted frozen with unsavory fat layer, served with cheap marmalade, octopus and calamari entree was measly, wine was poor quality",
    "The food was wonderful",
    "Food was delicious (small plates)",
    "Food was wonderful and interesting",
    "Very good food",
    "Food was a major disappointment",
    "Food is just okay",
    "Menu items are confusing and unusual",
    "Food was good",
    "Food was outstanding, best arancini ever had, delicious pizzettas, moist pork chop with generous serving",
    "meals were lovely",
    "Food was mediocre - pork served cold with excessive marbled fat, hard polenta, underwhelming dessert, oxtail and risotto were slightly chewy",
    "Food: It is the best",
    "No specific food review provided",
    "Amazing food",
    "Good food",
    "Foods was great",
    "The food is really good, with options for small and large servings of many dishes",
    "Pretty good food, but not great",
    "Solid Italian food with fantastic appetizers",
    "Food is very good",
    "Food was terrific, squid was very good.",
    "Food was good",
    "Calamari and squid dish well-received, diverse menu options for different dietary needs, excellent desserts",
    "",
    "Love the food",
    "Desserts were great, meal was just okay, beans served with pork chop were under cooked.",
    "Food excellent, delicious cocktails, impressive Italian wine list",
    "The menu offers delicious, thoughtfully prepared dishes.",
    "The pasta was delicious",
    "No clear food or service quality information provided in this review.",
    "Fun, creative menu, well executed",
    "Food was delicious with ample portions, including branzino, pork chop, squid spaghetti, and 1840 Traditionale cocktail. The squid pasta was spicy.",
    "The chicken liver pate appetizer was excellent, salads and pasta were delicious, desserts were enticing",
    "Delicious, innovative Italian food",
    "Food was simply excellent",
    "Grilled calamari appetizer was excellent; risotto was gluey; other food items were passable at best",
    "Too much garlic, over cooked pasta, flavorless food",
    "Wonderful food",
    "The food was really good, rated as \"5\" for some dishes",
    "Bacalao, spaghetti vongole, uovo salad, and squid ink pasta were utterly delicious and crave worthy. The chocolate salami dessert was excellent.",
    "Food was impressive, cocktails were well blended",
    "Duck papardelle had lumps of stuck together pasta, radicchio salad had over-oily crostini, baccala lacked flavor, smoked trout was delicious",
    "Food was excellent",
    "Main courses were delicious and portions were large",
    "Amazing French toast",
    "Fish and seafood dishes particularly good, appetizers and salads good, food quality comparable to more expensive Italian restaurants",
    "Original dishes with careful thought to how the flavors work together",
    "Food was authentic and flavorful, with standout dishes being Risotto with Oxtail, Tortelloni, Cacio e Pepe, and Tagliatelle with duck ragout. Great amaro selection including rare regional specialties.",
    "Food was average, menu sounds great but food flavor didn't match expectations",
    "Excellent cuisine, slow-cooked chicken with delicate herbs was outstanding - very tender, flavorful but subtle. Chocolate mousse dessert with chocolate-coated raspberry gelatin was divine.",
    "Very good food, authentic Italian cuisine",
    "Delicious food, different from typical Italian restaurants",
    "Excellent food and presentation",
    "Food was pretty good but not outstanding; vegetarian dishes were bland; meat dishes were enjoyable",
    "Great food",
    "Limited vegetarian options, food was elegant but heavy",
    "Food was ample with good pasta and appetizers, carpaccio was good but needed more parmesan cheese and olive oil drizzle",
    "Dishes lacked flavor, appetizer tasted pre-prepared and refrigerated",
    "Interesting menu options with something for every taste",
    "All dishes were excellent and beautifully prepared. The chocolate dessert was unbelievable!",
    "Delicious food with generous portions and reasonable prices",
    "Food was poorly executed - cacio e pepe lacked pepper and pecorino cheese, pasta served with gluey cheese in milky liquid, vegetable sides were lackluster, all dishes needed seasoning",
    "varied menu options",
    "Crunchy coated chicken sandwich on homemade bread was delicious",
    "Authentic and delicious Italian food, everything cooked to perfection",
    "Appetizers and desserts are excellent",
    "The food is very good, authentic and special",
    "Food was mediocre, nothing special",
    "Food was greatly enjoyed, authentic and inventive Italian cuisine",
    "Squid and octopus were delicious, not rubbery; ravioli was good",
    "Food was mediocre (\"meh\")",
    "Food was underwhelming - pasta dishes were underseasoned and dry, chicory salad underdressed, appetizers were tasty, desserts received mixed reviews.",
    "Every dish was wonderful",
    "Small plate options available for sharing",
    "",
    "Food was severely undercooked",
    "Fantastic wine list and thoughtful, authentic menu",
    "Meat was overcooked, pasta was good",
    "Food was excellent, including perfectly cooked grilled branzino, Cacio e Pepe pasta, bell peppers, mista salad, Pollo, linguini with Manila clams, grilled eggplant side dish, and perfectly made martini.",
    "Apps were great, entrees were bland and not worth the price",
    "Food was late",
    "Good food",
    "Food is very good",
    "Food was mediocre, fish was poorly filleted with bones left in, making it inedible",
    "Food items were consistently good to very good, with diverse small plates offering various tastes. Wine list features interesting Italian selections.",
    "Beautifully prepared food, loved the pizza",
    "Wonderful food",
    "Food was \"foodie\" oriented; pork loin special was very fatty and inedible",
    "Terrific food with imaginative dishes, beautifully prepared and tasted wonderful",
    "Excellent Italian food, Arancini better than Sicily's version, tasty oxtail ravioli, poached ling cod with well-balanced tarragon sauce, large entree portions",
    "Food was excellent - spaghettini with puttanesca sauce was divine, tomato salad with ricotta, ravioli with oxtail stuffing, frittata, and amazing dessert",
    "Food was good but not outstanding, dishes were well-presented, appetizer portions were small while main dishes had sufficient portions",
    "Excellent meal with delicious selections, including vegetarian options",
    "Great food",
    "Food was outstanding, with notable seasonal menu updates",
    "Very inventive and creative food with amazing ingredients. Not every dish was a complete success but quality ingredients ensured nothing was bad.",
    "Delicious food with options for all dietary restrictions",
    "No clear food or service quality information provided in this review.",
    "Food was fantastic Italian cuisine with standout dishes including Uovo salad with panko-crusted deep-fried egg, ox-tail ravioli, and semifreddo dessert. Option available for half portions.",
    "Food was ok, not exceptional; red leaf lettuce salad was tough and unpleasant; pasta was too al dente",
    "Delicious northern Italian food",
    "Delicious food",
    "Food is always good",
    "Food was excellent. Best espresso I've had since trip to Italy.",
    "Food quality: Wine and beer were good. Fried shrimp appetizer was great but accompanying vegetables were greasy and unrecognizable. Chicken dish was different from what was described. Risotto was poorly prepared, lacking proper texture and flavor. Food presentation was awful and portions were inconsistent with what was promised.",
    "Great food and value",
    "Food was excellent",
    "Great food, exquisite Chef's preparation",
    "Food was disappointing - bread was cold, crumbly and tasteless; thin toasts were like cardboard; pasta lacked flavor; steak was unremarkable; calamari well-cooked but flavorless; risotto balls were bland; chicken pate was decent",
    "No specific details about food or service quality were provided in this review.",
    "Food was enjoyable",
    "consistently good food",
    "Interesting cocktails, outstanding restaurant cured sausages Salumi plate, exceptional Seabass",
    "Food was delicious",
    "Good food",
    "Home made pasta dishes and other items were delicious, quality simple ingredients used creatively by chefs",
    "Food was bland, pasta dishes lacked flavor and required additional seasoning (salt, pepper, crushed red pepper)",
    "Loved the food",
    "Wood grilled items are perfectly prepared, desserts are noteworthy, reasonable prices, good wine selection with Italian and American options",
    "Great food, inventive but not fussy",
    "Sea bass was wonderful, fish dishes are strong, appetizers and pasta are good, chocolate mousse dessert was irresistible, authentic Italian food",
    "Excellent food",
    "Chicken salad appetizer had minimal chicken pieces with bone fragments, though greens were fresh",
    "Food quality was consistently good, with standout dishes including pasta with duck ragu, grilled lamb shoulder chops, and squid ink pasta with calamari. The food represents good dining value.",
    "Excellent, fresh food made with high quality ingredients - rabbit sugo special with buckwheat parpardelle and gorgonzola sauce, squid ink spaghetti with tomatoes and chiles, and trout flatbread",
    "The sausage burger was flavorful, not oversized, with delicious peppers and soft, fresh bread",
    "Food was mediocre and disappointing",
    "Delicious homemade food, excellent espresso",
    "amazing food",
    "The food is delicious, particularly the salads. The deep fried risotto and mozzarella balls with green tomatoes, and the baby kale salad were tasty and novel.",
    "Boring salad, extremely hard lamb, poor food quality",
    "Tuna Tartare, Aroncini, calamari were excellent, pork chop received rave reviews, oxtail ravioli was tasty though pasta was slightly thick and firm, sauce was wonderful, desserts had good variety and generous portions",
    "Food was decent but not exceptional; lamb dish was unimpressive while cappelletti and risotto dishes were enjoyed.",
    "The dessert featured great attention to details and the wines were amazing",
    "Enjoyed the food",
    "Salads were divine, pasta was delicious, consistently good food across multiple visits",
    "Many great choices for salads, appetizers, pastas, and main courses",
    "The grilled sausage and polenta was tasty and generous, grilled squash was fresh and tasty, though could have used some herbs. The menu offered good lunch choices with half portion options.",
    "Mixed greens salad with grano padano and chicken was generous and perfect for lunch; ciabatta sandwich with porcetta came with homemade chips that were good but partially soggy; Italian Sauvignon Blanc was quite nice.",
    "Food was spectacular - seasoned perfectly",
    "Cocktails were great, pasta dish was lacking in taste",
    "Great food, portions were adequate with two appetizers and two mains being more than enough to share",
    "Not enough information to extract any specific food or service quality details.",
    "Chopped liver with fig jam was very good, tuna dish was fine, dessert was disappointing in taste",
    "Delicious, well prepared, innovative menu",
    "Great menu with lots of small plate options, pasta dishes available as appetizers",
    "Food is very good and unique",
    "Loved every bite",
    "High quality cocktails, small plates, and entrees. Desserts were particularly high quality. Lamb shank and calamari/octopus dishes were delicious. Wine list provided great selection.",
    "Excellent starters, good main courses, awesome desserts.",
    "Food was excellent - frico and eggs balanced with tasty green salad, polenta and guancaile was amazing",
    "Food was terrible overall, baked ricotta was the best dish with nice minted zucchini but bland, crackers were stale and unsuitable. Trout was fishy and served with odd flatbread. Octopus and calamari were inedible with poor texture, mealy octopus, and rubbery flavorless squid.",
    "Excellent food",
    "No specific details about food or service quality were provided in this review.",
    "Outstanding Italian food with interesting wine list",
    "",
    "Good cocktails, great chocolate mousse with sherbet dessert",
    "Salume was especially good, salads and appetizers were enjoyable, pastas were perfectly cooked with fresh local ingredients, rabbit ravioli was a favorite",
    "Creative cuisine, appetizers delicious but small portions for the price, limited salad appetizer options",
    "Food was outstanding",
    "Great menu with superb execution",
    "Food order requests were not fulfilled (salad dressing not served on side, ingredient not removed from main dish as requested)",
    "Food delicious, quality ingredients",
    "High end Italian food, interesting and delicious dishes, appetizers and starters are moderately priced, excellent bar selection, good wines, great brunch menu",
    "Absolutely delicious food",
    "Wilted arugula in appetizer, minimal trout portion with tiny yogurt sauce, fragile cracker bread, overcooked tuna",
    "Food was excellent - house baked ricotta with pumpkin seeds was outstanding and warm, salted cod mousse was delicious, entrees were delicious",
    "Interesting Uovo salad with Parmesan-crusted soft boiled egg, enjoyed the pastas, bread service could be improved by offering warm bread with olive oil and balsamic vinegar",
    "Nice Italian wines, wonderful pasta",
    "Food is fine",
    "restaurants are all so good",
    "Salad and pasta were delicious, spaghetti was perfectly al dente and tasty",
    "No clear food or service review details provided in this feedback.",
    "Food was inconsistent, Pepe pasta lacked pepper and was too salty on previous visit, lamb shoulder was tough with excessive fat and gristle",
    "Authentic north Italian food",
    "Food was bland and uninteresting; pollo salad had minimal chicken and was over-dressed, trout and arugula salad had insufficient dressing with limp greens and over-ripe raspberries, trout was barely smoked with fishy taste, house-made sausage was bland with flavorless cabbage and polenta.",
    "Beautiful, creative and tasty authentic Italian dishes, particularly from Lombardy region",
    "AWESOME food",
    "Very good food",
    "Food was underseasoned",
    "Almost everything ordered was delicious, pork and polenta special was great, trout salad was not recommended",
    "Menu was interesting and delicious",
    "The food is DELICIOUS and the cocktails are great",
    "Amazing food",
    "Wonderful creative and well presented food",
    "Salad was great, veg fritto greasy with too heavy breading, pizzetta too tough to cut, ravioli, salmon, and chicken were good but not special",
    "Homemade pasta with lamb ragu was ample and delicious, salad with faro was good",
    "Food was excellent, particularly the frittata and egg dishes with pork cheeks (noted as better than bacon), good coffee, and charcuterie appetizer was a good option.",
    "Food was authentic and delicious",
    "NY steak was cooked correctly but unremarkable; beans were bland",
    "No food review provided in this feedback",
    "Excellent food",
    "Delicious meal, risotto with oxtails and pizette were very good.",
    "Many different items were served, all truly delectable",
    "Nice menu",
    "Food is good",
    "Love the food",
    "Food was delicious, particularly recommends the ricotta appetizer, cocktails were inspired",
    "Local Red Frilly greens salad was inventive and good, Spinach Fettucini with Pork Ragu was delicious, Organic Cauliflower Bistecca with puttanesca sauce was not impressive",
    "Soggy flavorless farrow salad, salami that looked and tasted like chipped ham.",
    "Food was cold, lacking in flavor, presentation was okay",
    "Delicious food",
    "Food was spot on, cacio e pepe is recommended",
    "Food was great, cocktails were excellent",
    "Food is always good",
    "Unable to extract specific food or service feedback from this review as it only contains general positive expressions without details about food or service quality.",
    "Food was excellent with notable dishes including Cauliflower, calamari with Sicilian caponata, and special lamb stuffed cannelloni",
    "No specific food review provided",
    "Squid was good, cauliflower was tasty and served in huge portion, cacio e pepe was gummy and poor quality",
    "Food lacked in every way possible",
    "Food is delicious and consistent",
    "Lamb was great, enjoyed the Neapolitan dessert",
    "Regional food was traditional and delicious",
    "Delicious Italian fare and cocktails",
    "The menu and execution of it was both authentic and very good.",
    "Great food",
    "This review does not contain specific information about food or service quality.",
    "Food was delicious, including the Ricotta/Asparagus/Prosciutto/Hazelnut appetizer, Nebbiolo-braised oxtail risotto, Il Maiale (pork belly, sausage, and ribs), and Rosemary Crema Cotta dessert. The Pera Invernale cocktail was exceptional.",
    "Food was delicious - risotto, pasta with pork ragu, frilly lettuces salad, and sangiovese wine",
    "Food was great",
    "Food was well prepared, sausage/ribs/pork belly was very good",
    "Food and cocktails are very good",
    "Food was tasty",
    "Food was OK but nothing special",
    "Lamb was well done and very fatty, salad had overcooked egg",
    "Good food",
    "Prosciutto was beautiful quality and fresh, chicken liver pate was good but strong flavored, pastas and pizzelle were excellent, aged Carnaroli risotto was slightly sour, oxtail ragu excellent, pork entree well executed but plain flavored, Montblanc dessert disappointing, fruit crisp okay, good cappuccino.",
    "",
    "Appetizer of asparagus and ricotta cheese was delicious; main course of pasta and pork was bland; no bread served",
    "Amazing chicken salad, other entrees delicious",
    "Great food",
    "First visit: Meals were tasty, including lamb shoulder, swordfish, oxtail risotto, and grilled chicken. Second visit: Swordfish and chicken lacked previous quality, pork dish was under-seasoned, pasta was undercooked.",
    "Great food",
    "Delicious food, interesting cocktails",
    "The food was very good",
    "Enjoyed the pasta dishes",
    "Food was good but not outstanding, with interesting menu options",
    "Absolutely wonderful food",
    "Squid ink spaghetti was loved, olive tapenade was wonderful with bread, excellent cocktails",
    "Both salad and entree were soggy, salad had excessive dressing, chicken and juices made bread crumbs soggy",
    "Food was just OK with hit or miss dishes - terrific pate appetizer, ricotta appetizer trying too hard, chicken nicely cooked, swordfish perfectly cooked but heavy sauce, farro side seemed random with fish",
    "Fine Italian food with sufficient vegetarian options",
    "Chicory salad was fresh and well presented; buckwheat pasta was a bit oily but had delicious rich cheesy filling; cocktails were okay; wine was good",
    "There isn't enough specific information about food quality or service in this review to provide a meaningful extraction.",
    "Food was tasty and flavorful",
    "Food was mediocre at best.",
    "Limited menu options, food was tasty but not exceptional",
    "Food was good",
    "Northern Italian inspired food was delicious, comparable to food in Piedmonte",
    "Food is authentically Italian with good choices, though menu lacks variation. Food quality is acceptable but not excellent and needs more consistency.",
    "Food was loved - ravioli, lamb, spaghetti served. Very good beer.",
    "Unique food with small plates to share and enjoy",
    "The food was good",
    "Food was salty. Squid was not adequately cleaned and overpowered by a caponata like sauce.",
    "Food portions were small and not filling, menu was mostly Italian with dishes being too experimental",
    "Fresh homemade pasta, fresh and unique salads that are above average quality",
    "Food was unsatisfactory - pasta dish was extremely spicy without any menu indication, to the point of being inedible",
    "",
    "Excellent foods and wines",
    "Food has diverse options including meat, pasta, and fish dishes with creative presentation and clean uncluttered flavors",
    "Food was enjoyable with good vegetarian options and grilled calamari, suitable for sharing",
    "Food was mediocre with small portions and high prices. Menu was confusing with inconsistent descriptions of sides and contained typos.",
    "Outstanding menu selections with wonderful variety, phenomenal desserts",
    "Appetizer was strange, beet risotto was enjoyable, dessert was tasty, hibiscus drink was good",
    "The chicken liver with quince jelly and pappardelle with duck were delicious, but the bacalao was disappointing and described as a deep-fried nothing.",
    "Great menu with option for half portions of pasta, delicious items, good cocktails",
    "The baccalau wasn't tasty though the accompanying salad was good; frisée salad with crispy poached egg was good; pasta with duck breast was very good; squid and octopus entree was good; swordfish in tomato sauce with olives was mediocre.",
    "No specific food review provided",
    "Excellent, imaginative food",
    "Appetizer was interesting, main dish was terrible - similar to oatmeal with beet juice, too dense and filling, dessert was creative and scrumptious",
    "Many unique Italian dishes not commonly found in other restaurants, excellent for sharing, features unique ingredient combinations",
    "Food was decent",
    "Food was terrible, bland and unseasoned salad and calamari appetizer. Branzino special was not seasoned and not properly filleted. Seafood pasta special had unopened clams. Duck ragout pasta was bland.",
    "Branzino was small and lacked moisture and flavor, cauliflower was very nice, pastas were fine but not special",
    "Outstanding food, particularly the fergola sarda dish",
    "Frizzled greens salad with perfectly prepared soft-boiled egg, Squid ink pasta was delicious",
    "Seafood with couscous had small portions, hard and undercooked couscous, old-tasting seafood with little flavor, and was overly salty. Dessert was misrepresented - received a small soft chocolate cookie with chocolate sauce instead of chocolate cake.",
    "Food was delicious, particularly the Il Maiale dish with remarkably lean pork belly, enjoyable cabbage and beans. The Nebbiolo wine was excellent and well-priced. The Torta al Cioccolato dessert was outstanding, and the Pera Invernale cocktail was delicious.",
    "Food was delicious, though the dungeness crab pasta came with uncracked crab without proper tools (cracker, pick) to handle it",
    "Food was beautifully presented but bland",
    "No food review provided",
    "Frisée salad with deep fried soft boiled egg was perfect. Charcuterie plate was small with superb quality cured meats but bland roast pork. Black ink spaghetti with calamari and calamari+octopus guancale were superb. Dungeness crab pasta was bland but had excellently prepared crab.",
    "Pasta with duck ragu was fair with very al dente pasta and insufficient sauce; salad with egg was good; apple crumble dessert was not great",
    "Authentic Italian cuisine, generally well prepared",
    "Enjoyed the meal",
    "Food was mediocre, dishes were inconsistently cooked with some overcooked and undercooked portions, served lukewarm. Fixed New Year's Eve menu was disappointing except for the fish dish that was sent back and returned properly cooked and hot.",
    "Tasty food with wonderful flavor, though some dishes were small in portion size",
    "Pizzelle, frizzy salad with uovo, and cauliflower \"bistecca\" were particularly good and delicious",
    "Food portions not overly generous but excellently prepared",
    "Great food",
    "Unique Italian menu with excellent food items, half plates available to try multiple dishes, all dishes prepared with perfection",
    "Food was a disappointment",
    "Food okay, small portions, limited menu options",
    "Food was plentiful, beautiful and delicious",
    "Delicious cocktails, innovative and authentic rustic Italian cuisine with a modern flare",
    "Pastas were especially good, cocktails and wine selection were fantastic",
    "Creative food combinations, menu offers flexibility with portion sizes and prices",
    "The salad was excellent. Ravioli dish was on oily side. Duck breast in pasta dish was ground up and did not taste especially of duck.",
    "Food was great - the risotto and the trout were fabulous",
    "Underseasoned pasta with weird texture",
    "The papparadelle with duck is marvelous, and the duck liver pate with pears is wonderful with generous portions",
    "No food review provided",
    "Small well designed menu with sufficient variety: squid ink pasta, cauliflower steak, pizzele, etc. The choices don't change often but they're seasonal and well prepared.",
    "Food was excellent but portions were tiny",
    "Chicken ravioli broth was too salty",
    "A tad pricey",
    "Food was excellent - perfectly made cocktails, interesting salad with crispy egg, flavorful and perfectly cooked swordfish that was moist and tender, delicious Il Maiale pork sampler",
    "Food was exceptional",
    "Food was mediocre - calamari, beef short rib, buckwheat ravioli, and pesce spada (swordfish with spaghetti) were poorly executed and not well prepared, though edible.",
    "Food average",
    "Pasta dishes bland, appetizers very good",
    "Mussels were fantastic, Ricotta Cheesecake with Lemon Curd was delicious, menu offers good variety of pastas, seafood, meats, and vegetarian options",
    "Hard beans, meat that tasted old, impossible to cut cabbage, tiny portions",
    "Food was good with flavorful sausage and bean dish, delicious broccoli and cheese pizza (though structurally weak in middle), and excellent Manhattan cocktail",
    "Food is excellent, particularly the pizzelle and cauliflower dishes which are delicious, especially suitable for vegetarians",
    "Two dishes were excellent, two dishes were mediocre. Quality not fully justifying the prices.",
    "Food was disappointing - chicken liver appetizer was bland with dry bruschetta toast and weak pear flavor, roasted seafood had tasty calamari but overcooked octopus, dish lacked vegetables, meat dish was bland",
    "Creative menu and excellent wine list",
    "Excellent Italian food, fabulous food, very reasonable pricing",
    "The food was delicious with flavors that popped",
    "Exceptionally good nicely prepared food, good wine",
    "Appetizers were delicious including prosciutto and small pizzas. Pappardelle with duck was good but not great. Risotto was good but came with an unexpected large piece of beef.",
    "Cocktail and appetizers were enjoyable, but the pappardelle pasta was extremely dry and inedible, though the shrimp was fine",
    "Good food, but menu lacks variety and specials",
    "Pizzelle, pizza frites, pappardelle pasta with prawns, and cauliflower \"bistecca\" were delicious",
    "Delicious food",
    "Really good food",
    "Good vegetarian dishes",
    "thoroughly delicious dinner",
    "Calamari is great; pasta and white sauce dishes are disappointing",
    "Good food",
    "Food was delicious, oxtails with creamy polenta were tender, squid ink spaghetti with calamari and bottarga was flavorful and cooked al dente, butternut squash and arugula salad had fresh arugula but underwhelming squash, swordfish tartare was ample and ceviche-like",
    "Sophisticated Italian menu",
    "Not stellar food quality",
    "Great food",
    "Cocktails are pretty good, main course food fails to impress, dessert and coffee were worth having",
    "Food portions are small and quality needs improvement, food temperature issues",
    "Great food at a reasonable price",
    "amazingly delicious",
    "Food was okay but not hot, coffee had grounds, dessert tasted like applesauce with ice cream",
    "The food is very good with interesting flavors, menu designed for all levels of affordability and taste",
    "The food is good",
    "The food was delicious and superb",
    "Fun, diverse selection of small and large plates, gourmet quality cuisine with sophisticated modern take on classic Italian",
    "Food is mixed - pasta with prawns and beans was unremarkable with only one prawn; calamari and octopus entree was excellent; pasta with chicken and leeks was excellent; wine list about average",
    "Food was good but nothing exceptional",
    "High quality food with beautiful presentation",
    "Good food",
    "Menu is too complicated, deviating from simple Italian food preferences",
    "Main courses of chicken and fish were overcooked and bland",
    "No clear food or service quality information provided in this review.",
    "Salumi plate and prosciutto plate appetizers were enjoyable, squid pasta dish and papparadelle pasta were favorites, vegetable frito was disappointing",
    "Food was really good but portions were a little on the smaller side",
    "Delicious food",
    "None",
    "Interesting and unusual combinations of ingredients",
    "Squid ink pasta dish was flavorful",
    "Food was mediocre - garlic lemon fettuccine partially uncooked, olive tapenade not enjoyable, pizzelle unusual and disappointing, bread served warm but oil leaked through bag",
    "Food is described as \"just okay\"",
    "Food is good but salads need improvement in seasoning (acid/salt), menu is meat-heavy",
    "Food was very good with generous portions; appetizers were cold - cauliflower was acceptable at room temperature but fried seasonal vegetables needed to be hot",
    "Wonderful food",
    "Food wasn't good, salads were not enjoyable, pasta with prawns was bland, squid ink pasta was too spicy, meats were good, dessert options were not appealing",
    "Dessert (Apple cobbler) was good, appetizer (Italian beans with tuna) had no flavor, butternut squash salad lacked flavor.",
    "Pasta dishes were bland despite being fresh & well cooked",
    "Food was excellent with standout dishes including salumi plate, pizzoccheri ravioli, pork mixed grill, and semifreddo. Great Italian wine selection including regional varieties like Semidano and Bovalo.",
    "Not typical Italian fare with good taste and quality food",
    "Smoked trout starter was lovely; roasted butternut squash salad with oyster mushrooms didn't work; Baccala with chickpeas bland and gummy; Grilled calamari and octopus with caponata was terrific; Roasted cauliflower entree light but good"
]